export default () => {
  return (
    <div className="static-error terms-of-use">
      <div className="container">
        <div className="row">
          <div className="col-xs-12">
            <h1>
              ข้อกำหนดและเงื่อนไขทั่วไปของ hooq (&ldquo;ข้อกำหนดทั่วไป&rdquo;)
            </h1>
            <hr />
            <p className="bold">
              กรุณาอ่านข้อกำหนดทั่วไปนี้ก่อนลงทะเบียนและใช้บริการของ HOOQ
              (&ldquo;บริการ&rdquo;) หรือ HOOQ โมบายแอพพลิเคชั่น
              (&ldquo;แอพพลิเคชั่น&rdquo;) หรือเว็บไซต์ของ HOOQ
              (&ldquo;เว็บไซต์&rdquo;).
            </p>
            <p className="bold">
              ท่านตกลงว่าข้อกำหนดทั่วไปนี้เป็นสัญญาที่ผูกพันตามกฎหมายระหว่างท่านกับ
              HOOQ DIGITAL PTE. LTD. (“HDPL”):) ซึ่งมีดังต่อไปนี้
            </p>

            <p className="bold">(A) ภาพรวม;</p>
            <p className="bold">(B) บริการ;</p>
            <p className="bold">(C) แอพพลิเคชั่นและเว็บไซต์;</p>
            <p className="bold">(D) บททั่วไป.</p>

            <p className="bold">
              ในกรณีที่มีข้อความขัดแย้งหรือแตกต่างกันระหว่างข้อกำหนดทั่วไปกับเงื่อนไขและข้อกำหนดอื่นใดระหว่างท่านกับ
              HDPL หรือระหว่างท่านกับคู่ค้าของ HDPL
              ให้ใช้ข้อความในข้อกำหนดทั่วไปบังคับกับความขัดแย้งหรือแตกต่างดังกล่าว
            </p>
            <hr />

            <h2>(A) ภาพรวม</h2>
            <ol>
              <li>
                ข้อมูลของบริษัท
                <ol>
                  <li>
                    HOOQ DIGITAL PTE. LTD.
                    เป็นบริษัทซึ่งจัดตั้งในประเทศสิงคโปร์โดยมีสำนักงานจดทะเบียนตั้งอยู่ที่
                    31 Exeter Road, Comcentre, Singapore 239732
                    (&ldquo;HDPL&rdquo;).
                  </li>
                </ol>
              </li>
              <li>
                เขตอำนาจและข้อจำกัด
                <ol>
                  <li>
                    HDPL ประกอบการให้บริการ แอพพลิเคชั่น
                    และเว็บไซต์จากประเทศสิงคโปร์
                  </li>
                  <li>
                    ข้อกำหนดทั่วไป รวมถึงการแก้ไขเพิ่มเติมใดๆ ซึ่งอาจทำโดย HDPL
                    เป็นครั้งคราวด้วยดุลยพินิจของตน
                    จะอยู่ภายใต้บังคับและการตีความตามกฎหมายสิงคโปร์
                    และข้อพิพาทใดๆ
                    ที่เกี่ยวข้องกับเรื่องดังกล่าวให้อยู่ภายใต้เขตอำนาจเด็ดขาดของศาลประเทศสิงคโปร์
                  </li>
                  <li>
                    กฎหมายท้องถิ่นที่ท่านพำนักอยู่อาจนำมาบังคับใช้ในกรณีที่จำเป็นเท่านั้น
                    และท่านอาจมีสิทธิในด้านการคุ้มครองผู้บริโภคบางประการภายใต้กฎหมายในเขตอำนาจที่ท่านพำนักอยู่
                  </li>
                </ol>
              </li>
              <li>
                การตัดสินใจของ HDPL
                <ol>
                  <li>
                    ในกรณีที่ HDPL สามารถกำหนดหรือตัดสินใจใดๆ
                    โดยใช้ดุลยพินิจของตนภายใต้ข้อกำหนดทั่วไปนั้น HDPL
                    สามารถใช้สิทธิกำหนดหรือตัดสินใจด้วยดุลยพินิจของตนโดยเด็ดขาดแต่เพียงผู้เดียว
                    โดย HDPL ไม่จำเป็นต้องให้เหตุผลหรือคำอธิบายใดๆ
                    สำหรับการกำหนดหรือการตัดสินใจของตนดังกล่าว อย่างไรก็ตาม
                    โดยไม่เป็นการกระทบต่อสิทธิที่กล่าวมาก่อนหน้านี้ หาก HDPL
                    ได้ให้เหตุผลหรือคำอธิบายใดๆ
                    ให้ถือว่าเป็นไปเพื่อการให้ข้อมูลเท่านั้น และไม่เป็นการผูกพัน
                    HDPL และไม่ถือว่าเป็นคำรับรอง คำรับประกัน
                    หรือข้อบังคับกระทำการใดๆ
                    สำหรับการกระทำในอนาคตหรือด้วยประการอื่นใด{' '}
                  </li>
                </ol>
              </li>
              <li>
                การติดต่อ HDPL
                <ol>
                  <li>
                    ในการติดต่อ HDPL ในเรื่องใดๆ ที่เกี่ยวข้องกับบริการ
                    แอพพลิเคชั่น และเว็บไซต์ ท่านสามารถติดต่อเราได้{' '}
                    <a href="mailto:support@hooq.tv">ที่นี่.</a>
                  </li>
                </ol>
              </li>
            </ol>

            <h2>(B) บริการ</h2>
            <ol>
              <li>
                คุณสมบัติในการสมัครและใช้บริการ
                <ol>
                  <li>
                    เพื่อที่ท่านจะมีคุณสมบัติในการสมัครและใช้บริการ
                    ท่านจะต้องปฏิบัติตามความในข้อกำหนดทั่วไป
                    และท่านจะต้องมีอายุที่เป็นผู้บรรลุนิติภาวะที่จะสามารถทำนิติกรรมได้ในเขตอำนาจที่ท่านพำนักอยู่
                    (และในทุกกรณี ต้องไม่ต่ำกว่า 18 ปีบริบูรณ์)
                    และมีความสามารถตามกฎหมาย
                    พร้อมทั้งสามารถเข้าเป็นคู่สัญญาในข้อกำหนดทั่วไปได้
                  </li>
                </ol>
              </li>
              <li>
                ข้อกำหนดการใช้บริการ
                <ol>
                  <li>
                    ท่านรับทราบและตกลงว่าการให้บริการอย่างต่อเนื่องแก่ท่านนั้นอยู่ภายใต้เงื่อนไขดังต่อไปนี้:
                    <ol>
                      <li>
                        ท่านกระทำการในฐานะเป็นตัวท่านเองอยู่ตลอดเวลาเท่านั้น
                        และไม่ได้กระทำการแทนบุคคลที่สาม
                      </li>
                      <li>
                        ท่านจะต้องปฏิบัติตามกฎหมาย กฎระเบียบและข้อห้ามอื่นๆ
                        ที่เกี่ยวข้องทั้งหมดในเรื่องการใช้บริการหรือคอนเท็นต์ที่อยู่ในบริการ
                      </li>
                      <li>
                        ท่านจะต้องทำให้มั่นใจว่าข้อมูลทั้งหมดที่นำมาให้กับ HDPL
                        เป็นข้อมูลที่ครบถ้วน ถูกต้องและเป็นปัจจุบัน
                        และในกรณีที่มีการเปลี่ยนแปลงใดๆ ในข้อมูลดังกล่าว
                        ท่านจะต้องแจ้งการเปลี่ยนแปลงดังกล่าวต่อ HDPL
                        ทันทีตามแบบฟอร์มที่ HDPL กำหนดเป็นครั้งคราว
                      </li>
                      <li>
                        ท่านจะต้องรับผิดแต่เพียงผู้เดียวในการใช้และปกป้องข้อมูลส่วนบุคคลของท่าน
                        (รวมถึงพาสเวิร์ดและ/หรือหมายเลข PIN) ในขณะที่ใช้บริการ
                        และ
                      </li>
                      <li>ท่านได้ชำระเงินค่าสมาชิกทั้งหมดที่เกี่ยวข้องแล้ว</li>
                    </ol>
                  </li>
                  <li>
                    ท่านรับทราบและตกลงต่อไปอีกว่า:
                    <ol>
                      <li>
                        การใช้บริการของท่านเป็นไปใช้เพื่อการส่วนตัวและไม่ใช่ในทางพาณิชย์
                        เท่านั้น
                      </li>
                      <li>
                        ท่านสามารถลงทะเบียนอุปกรณ์ได้สูงสุดห้า (5)
                        เครื่องสำหรับการใช้บริการ
                        และสามารถใช้บริการได้พร้อมกันสอง (2) เครื่อง
                      </li>
                      <li>
                        คอนเท็นต์ที่ดาวน์โหลดมาจากบริการ
                        (เฉพาะกรณีที่อนุญาตและเกี่ยวข้อง)
                        สามารถรับชมได้เฉพาะกรณีที่ (a)
                        ความเป็นสมาชิกของท่านยังมีผลอยู่ หรือ (b)
                        ท่านได้รับการอนุญาตที่เกี่ยวข้องสำหรับคอนเท็นต์นั้น
                        (content license) โดยมีการเก็บค่าธุรกรรมเป็นค่าตอบแทน
                        ทั้งนี้ ภายใต้ข้อกำหนดของข้อ 3.3
                      </li>
                      <li>
                        ท่านจะต้องไม่เก็บ ดาวน์โหลด ทำซ้ำ จำหน่าย/เผยแพร่
                        ดัดแปลง นำออกแสดง เล่น ตีพิมพ์/เผยแพร่ ให้อนุญาตใช้
                        สร้างงานข้างเคียง (derivative works) เสนอขาย หรือใช้
                        (โดยไม่ได้รับอนุญาต)
                        ซึ่งคอนเท็นต์และข้อมูลที่อยู่ในบริการโดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจาก
                        HDPL หรือผู้ให้อนุญาตใช้สิทธิแก่ HDPL
                      </li>
                      <li>
                        ท่านจะต้องไม่เลี่ยง ถอดออก เปลี่ยนแปลง ปิดการใช้งาน
                        (deactivate) ทำให้เสื่อมลง (degrade)
                        หรือขัดขวางสิ่งที่มีไว้ป้องกันคอนเท็นต์ใดๆ ในบริการ{' '}
                      </li>
                    </ol>
                  </li>
                </ol>
              </li>
              <li>
                วีดีโอออนดีมานด์ประเภทสมาชิก วีดีโอออนดีมานด์ประเภทธุรกรรม
                วิธีการชำระเงินและการออกใบแจ้งค่าบริการ
                <ol>
                  <li>
                    วีดีโอออนดีมานด์ประเภทสมาชิก (Subscription-based Video on
                    Demand)
                    <ol>
                      <li>
                        ท่านรับทราบและตกลงว่าท่านได้อนุญาตให้ HDPL
                        (หรือคู่ค้าของ HDPL ถ้าเกี่ยวข้อง)
                        เรียกเก็บค่าสมาชิกต่อเนื่องโดยอัตโนมัติสำหรับการให้บริการ
                        ในอัตราที่ใช้บังคับตามที่โพสต์ไว้ในแอพพลิเคชั่น และ/หรือ
                        เว็บไซต์ ผ่านวิธีการชำระเงินที่ท่านได้เลือกไว้ ทั้งนี้
                        จะมีการเก็บค่าสมาชิกต่อเนื่องนี้โดยอัตโนมัติโดยไม่ต้องแจ้งให้ท่านทราบอีก
                        ผ่านวิธีการชำระเงินที่ท่านได้เลือกไว้ตามรอบบิลที่ใช้บังคับของ
                        HDPL (หรือคู่ค้าของ HDPL ถ้าเกี่ยวข้อง) ซึ่งอาจจะเป็น ณ
                        เวลาสิ้นสุดระยะเวลาทดลองใช้และก่อนการเริ่มอายุแผนสมาชิกที่เลือกไว้
                        หรือ ณ เวลาสิ้นสุดอายุแผนสมาชิกที่เลือกไว้
                        ตามที่ท่านได้แจ้งหรือตกลงด้วย ณ เวลาสมัครสมาชิก
                      </li>
                      <li>
                        ในกรณีที่เกี่ยวข้อง ท่านรับทราบและตกลงว่า
                        เมื่ออายุแผนสมาชิกที่ท่านเลือกไว้สิ้นสุดลง
                        แผนสมาชิกที่ท่านเลือกไว้เดิมสำหรับบริการจะได้รับการต่ออายุโดยอัตโนมัติโดยไม่ต้องแจ้งให้ท่านทราบอีก
                        เว้นแต่ท่านจะได้แจ้งให้ HDPL (หรือคู่ค้าของ HDPL
                        ถ้าเกี่ยวข้อง)
                        ทราบว่าท่านต้องการยกเลิกการต่ออายุดังกล่าวอย่างน้อยสอง
                        (2)
                        วันปฏิทินก่อนวันสิ้นสุดอายุแผนสมาชิกที่ท่านเลือกไว้ดังกล่าว
                        ท่านรับทราบและตกลงว่าท่านจะต้องรับผิดชอบแต่เพียงผู้เดียวในการติดตามดูว่าระยะเวลาอายุแผนสมาชิกที่ท่านเลือกไว้สิ้นสุดลงเมื่อใด
                        และเมื่อแผนสมาชิกที่ท่านเลือกไว้เดิมได้รับการต่ออายุโดยอัตโนมัติแล้ว
                        HDPL (หรือคู่ค้าของ HDPL ถ้าเกี่ยวข้อง)
                        มีสิทธิที่จะเรียกเก็บค่าสมาชิกจากท่านเพื่อการดังกล่าว
                      </li>
                      <li>
                        HDPL สงวนสิทธิในการเปลี่ยนหรือแก้ไขในเวลาใดๆ
                        ซึ่งแผนสมาชิก ค่าสมาชิกสำหรับบริการ และรอบบิลจัดเก็บ
                        การแก้ไขดังกล่าวให้มีผลบังคับเมื่อได้โพสต์ลงในแอพพลิเคชั่น
                        และ/หรือ เว็บไซต์ หรือตามวันที่ระบุไว้เป็นอย่างอื่น
                        ทั้งนี้
                        การที่ท่านใช้บริการต่อเนื่องถือว่าท่านตกลงในการแก้ไขดังกล่าวอย่างเป็นที่ยุติ
                      </li>
                      <li>
                        ท่านจะต้องรับผิดชอบชำระค่าสมาชิกที่ถึงกำหนดตลอดอายุแผนสมาชิกที่ท่านเลือก
                        แม้ว่าท่านจะได้ยกเลิกความเป็นสมาชิกดังกล่าวก่อนสิ้นสุดอายุลง
                        ทั้งนี้ ส่วนลดต่างๆ
                        ที่อาจมีการเสนอให้สำหรับแผนสมาชิกที่เลือกไว้อาจไม่สามารถใช้บังคับกับแผนสมาชิกที่ได้รับการต่ออายุได้
                        ซึ่งรวมถึงการต่ออายุโดยอัตโนมัติ การชำระค่าสมาชิกใดๆ
                        จะไม่สามารถคืนได้
                        เว้นแต่ในกรณีที่กฎหมายที่เกี่ยวข้องกำหนด
                        ค่าสมาชิกหรือค่าธรรมเนียมที่ค้างชำระจะต้องเสียดอกเบี้ยในอัตราร้อยละ
                        2 ต่อเดือน (หรือตามสัดส่วน ถ้าเกี่ยวข้อง)
                        ของจำนวนที่ค้างชำระ หรืออัตราสูงสุดที่กฎหมายอนุญาต
                        แล้วแต่จำนวนใดจะต่ำกว่า รวมถึงค่าใช้จ่ายทั้งหมดของ HDPL
                        ที่เสียไปในการเรียกเก็บหนี้
                      </li>
                    </ol>
                  </li>
                  <li>
                    วีดีโอออนดีมานด์ประเภทธุรกรรม (Transaction-based Video on
                    Demand)
                    <ol>
                      <li>
                        ท่านอาจได้รับการเสนอพรีเมี่ยมคอนเท็นต์ซึ่งปรากฏแท็กสีเหลืองอยู่เป็นครั้งคราว
                        โดยต้องชำระเงินต่อการเช่าชมแต่ละครั้ง (pay-per-rental)
                        ในราคาที่ HDPL จะกำหนดด้วยดุลยพินิจของตนแต่เพียงผู้เดียว
                        (“ค่า TVOD”) ท่านอาจซื้อคอนเท็นต์ดังกล่าวได้โดยชำระค่า
                        TVOD ด้วยวิธีการชำระเงินต่างๆ ที่กำหนดไว้
                      </li>
                      <li>
                        เมื่อ HDPL ได้รับค่า TVOD แล้ว
                        ท่านสามารถเริ่มรับชมพรีเมี่ยมคอนเท็นต์ที่เกี่ยวข้องได้ภายในเวลาสามสิบ
                        (30) วันปฏิทินนับจากวันที่ HDPL ได้รับค่า TVOD แล้ว
                        ผ่านวิธีการอย่างหนึ่งอย่างใดดังต่อไปนี้
                        (ตามที่อาจปรากฏให้รับชมได้ในเวลาใดๆ)
                        <ul>
                          <li>
                            สตรีมมิ่ง – ซึ่งอาจรับชมผ่านอุปกรณ์หลายเครื่อง
                            ทั้งนี้ ภายใต้ข้อกำหนดในข้อ 2.2 ข้างต้น หรือ
                          </li>
                          <li>
                            ดาวน์โหลด – ซึ่งจำกัดเพียงอุปกรณ์เครื่องเดียว
                            ทั้งนี้ เพื่อไม่ให้เป็นที่สงสัย
                            ในกรณีที่พรีเมี่ยมคอนเท็นต์ดังกล่าวได้ถูกดาวน์โหลดลงไปยังอุปกรณ์เครื่องใด
                            การรับชมคอนเท็นต์เดียวกันระหว่างระยะเวลาที่ให้รับชมเดียวกันนั้นจะถูกจำกัดอยู่เพียงแค่อุปกรณ์ดังกล่าวเท่านั้น
                          </li>
                        </ul>
                      </li>
                      <li>
                        เมื่อท่านกดปุ่ม “เล่น” / “Play”
                        ผ่านวิธีการอย่างหนึ่งอย่างใดที่ระบุไว้ในข้อ 3.3(b)
                        ท่านจะมีเวลาไม่เกินไปกว่าสี่สิบแปด (48)
                        ชั่วโมงนับจากเวลาที่ท่านกดปุ่ม “เล่น” / “Play”
                        ในการรับชมพรีเมี่ยมคอนเท็นต์ให้แล้วเสร็จ
                      </li>
                      <li>
                        ท่านรับทราบและตกลงว่าท่านได้อนุญาตให้ HDPL
                        (หรือคู่ค้าของ HDPL ในกรณีที่เกี่ยวข้อง) เรียกเก็บค่า
                        TVOD ต่างๆ ที่เกี่ยวข้องผ่านวิธีการชำระเงินที่ท่านเลือก{' '}
                      </li>
                    </ol>
                  </li>
                  <li>
                    การชำระเงินและการออกใบแจ้งค่าบริการ
                    <ol>
                      <li>
                        สำหรับการชำระเงินผ่าน Apple iTunes Store
                        โปรดทราบว่าท่านสามารถชำระเงินได้หากท่านอยู่ในเขตพื้นที่เดียวกับเขตพื้นที่ที่ระบุในบัญชี
                        Apple iTunes Store ของท่านเท่านั้น
                      </li>
                      <li>
                        ท่านจะต้องรับผิดชอบและชำระภาษีทั้งหมด
                        (รวมถึงภาษีสินค้าและบริการ) ซึ่งกฎหมายที่เกี่ยวข้องกำหนด
                      </li>
                    </ol>
                  </li>
                </ol>
              </li>
              <li>
                โปรโมชั่น
                <ol>
                  <li>
                    การทดลองใช้บริการอาจมีให้ในเวลาที่จำกัด ทั้งนี้
                    การทดลองใช้อาจมีให้เลือกหลายรูปแบบในเขตอำนาจตามกฎหมายที่ท่านอาศัยอยู่
                  </li>
                  <li>
                    คุณสมบัติของท่านในการทดลองใช้จะขึ้นอยู่กับดุลยพินิจของ HDPL
                    และการทดลองใช้ดังกล่าวอาจมีการเปลี่ยนแปลง ระงับ
                    หรือยกเลิกโดย HDPL ในเวลาใดๆ
                    โดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้าและไม่มีความรับผิดใดๆ
                    ต่อท่าน
                  </li>
                  <li>
                    HDPL เข้าเป็นพันธมิตรกับคู่ค้าที่ได้รับอนุญาตต่าง ๆ
                    เพื่อเสนอบริการในราคาโปรโมชั่นให้กับลูกค้าของตนเป็นครั้งคราว
                    ทั้งนี้ ในช่วงเวลาหนึ่ง
                    ท่านมีสิทธิได้รับประโยชน์จากโปรโมชั่นเดียวเท่านั้น
                    ซึ่งหมายความว่าหากท่านได้ใช้สิทธิประโยชน์ตามโปรโมชั่นหนึ่งจากคู่ค้าที่ได้รับอนุญาต
                    A สำหรับบริการ
                    ท่านจะไม่สามารถใช้สิทธิประโยชน์จากอีกโปรโมชั่นหนึ่งสำหรับบริการ
                    ไม่ว่าโปรโมชั่นนั้นจะมาจากคู่ค้าที่ได้รับอนุญาต A หรือ B
                    ก็ตาม
                  </li>
                  <li>
                    ในกรณีที่เกี่ยวข้อง ท่านรับทราบและตกลงว่า
                    เมื่อระยะเวลาทดลองใช้สิ้นสุดลง
                    แผนสมาชิกที่ท่านเคยเลือกไว้ในการใช้บริการจะเริ่มใช้บังคับโดยอัตโนมัติโดยไม่ต้องแจ้งให้ท่านทราบอีก
                    เว้นแต่ท่านจะได้แจ้งให้ HDPL (หรือคู่ค้าของ HDPL
                    ถ้าเกี่ยวข้อง)
                    ทราบว่าท่านต้องการยกเลิกแผนสมาชิกที่ท่านเคยเลือกไว้อย่างน้อยสอง
                    (2) วันปฏิทินก่อนวันสิ้นสุดระยะเวลาทดลองใช้ ทั้งนี้
                    ท่านรับทราบและตกลงว่าท่านจะต้องรับผิดชอบแต่เพียงผู้เดียวในการติดตามดูว่าระยะเวลาทดลองใช้สิ้นสุดลงเมื่อใด
                    และเมื่อแผนสมาชิกที่ท่านเคยเลือกไว้ในการใช้บริการเริ่มใช้บังคับแล้ว
                    HDPL (หรือคู่ค้าของ HDPL ถ้าเกี่ยวข้อง)
                    มีสิทธิที่จะเรียกเก็บค่าสมาชิกจากท่านเพื่อการดังกล่าว
                  </li>
                </ol>
              </li>
              <li>
                สิทธิในทรัพย์สินทางปัญญา
                <ol>
                  <li>
                    ทรัพย์สินทางปัญญาทั้งหมดในหรือที่เกี่ยวข้องกับบริการเป็นของ
                    HDPL และ/หรือผู้ให้ใช้สิทธิของ HDPL แต่เพียงผู้เดียว
                    “ทรัพย์สินทางปัญญา” หมายถึงสิทธิบัตร เครื่องหมายการค้า
                    เครื่องหมายบริการ ชื่อทางการค้า ชื่อโดเมน สิทธิในการออกแบบ
                    สิทธิในแบบผังภูมิวงจรรวม (semiconductor topography rights)
                    สิทธิในฐานข้อมูลในกรณีการสกัดข้อมูลหรือนำมาใช้ใหม่อย่างไม่เป็นธรรม
                    (database rights of unfair extraction and reutilisation)
                    ลิขสิทธิ์ (รวมถึงสิทธิในโปรแกรมคอมพิวเตอร์) สิทธิในโนว์ฮาว
                    (know-how)
                    และสิทธิในทรัพย์สินทางปัญญาหรือทรัพย์สินทางอุตสาหกรรมอื่นๆ
                    (ไม่ว่าจดทะเบียนแล้วหรือไม่และรวมถึงเอกสารประกอบการยื่นขอจดทะเบียนสิทธิใดๆ
                    เหล่านั้น)
                    และสิทธิหรือวิธีการคุ้มครองทั้งหมดที่เทียบเคียงได้หรือให้ผลคล้ายคลึงกันกับสิทธิใดๆ
                    ที่กล่าวมาดังกล่าวซึ่งอาจมีอยู่ที่ใดๆ ในโลก
                    ไม่มีข้อความใดในข้อกำหนดทั่วไปที่จะตีความได้ว่าเป็นการให้อนุญาตให้ใช้สิทธิหรือสิทธิในการใช้ใดๆ
                    แก่ท่าน (โดยปริยาย โดยหลักกฎหมายปิดปาก (estoppel) หรืออื่นๆ)
                    ซึ่งทรัพย์สินทางปัญญาใดๆ ในหรือที่เกี่ยวข้องกับบริการ
                    โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจาก HDPL
                    ทั้งนี้ สิทธิใดๆ ที่ไม่ได้มอบให้โดยชัดแจ้ง ณ
                    ที่นี้ให้ถือว่ามีการสงวนสิทธิไว้แล้ว
                  </li>
                  <li>
                    ตราบเท่าระยะเวลาที่ท่านสมัครใช้บริการ HDPL ให้สิทธิอันจำกัด
                    ไม่เด็ดขาด และไม่สามารถโอนได้แก่ท่าน ในการเข้าใช้บริการ
                    รับชมโดยวิธีสตรีมมิ่ง (streaming) เท่านั้น และดาวน์โหลด
                    (เฉพาะกรณีที่อนุญาตและเกี่ยวข้อง) ภาพยนตร์ รายการโทรทัศน์
                    และคอนเท็นต์อื่นๆ เพื่อวัตถุประสงค์ดังกล่าว
                  </li>
                  <li>
                    ท่านจะต้องไม่กระทำการ
                    (และจะต้องไม่พยายามหรือช่วยเหลือผู้อื่นในการกระทำการ)
                    ยุ่งเหยิง (tamper) ดัดแปลง ทำวิศวกรรมย้อนกลับ แยกส่วน
                    ถอดโค้ด (decompile)
                    หรือพยายามด้วยวิธีการอื่นใดเพื่อให้ได้มาซึ่งซอร์สโค้ดของบริการ
                    แอพพลิเคชั่น และ/หรือ เว็บไซต์ รวมถึงซอฟต์แวร์หรืออื่นใด
                    หรือสร้างผลงานข้างเคียง (derivative works) ในลักษณะใดซึ่ง
                    HDPL ไม่ได้อนุญาตไว้โดยชัดแจ้ง
                    เพื่อวัตถุประสงค์ของข้อกำหนดทั่วไปนี้ การทำ
                    “วิศวกรรมย้อนกลับ”
                    ให้รวมถึงการตรวจสอบหรือวิเคราะห์บริการเพื่อที่จะระบุซอร์สโค้ด
                    โครงสร้าง การจัดการ (organisation) การออกแบบภายใน อัลกอริธึม
                    หรืออุปกรณ์ถอดรหัสของเทคโนโลยีที่รองรับบริการ
                  </li>
                  <li>
                    คอนเท็นต์ทั้งหมดที่อยู่ในหรือปรากฏในบริการ แอพพลิเคชั่น
                    และ/หรือ เว็บไซต์ รวมถึง (แต่ไม่จำกัดเพียง) ข้อมูล
                    การสื่อสาร ซอฟต์แวร์ ข้อความ กราฟฟิคส์ ลิงค์ หรือเสียงต่างๆ
                    เป็นลิขสิทธิ์ของ HDPL บริษัทที่เกี่ยวข้องกับ HDPL
                    ผู้ให้บริการคอนเท็นต์ของ HDPL
                    และ/หรือผู้อนุญาตให้ใช้สิทธิซึ่งเป็นบุคคลภายนอกของ HDPL
                    คอนเท็นต์ดังกล่าวจะไม่สามารถนำไปทำซ้ำ ดัดแปลง โอนย้าย
                    จำหน่าย ตีพิมพ์ซ้ำ ดาวน์โหลด โพสต์ หรือส่งในรูปแบบใดๆ
                    หรือโดยวิธีใดๆ รวมถึง (แต่ไม่จำกัดเฉพาะ)
                    การถ่ายเอกสารหรือบันทึกโดยวิธีการทางอิเล็กทรอนิกส์หรือกลไกโดยไม่ได้รับอนุญาตล่วงหน้าเป็นลายลักษณ์อักษรจาก
                    HDPL และผู้ถือลิขสิทธิ์รายอื่นๆ นั้น
                    และโดยไม่เป็นการเสื่อมสิทธิที่กล่าวมาก่อนหน้านี้
                    ท่านตกลงว่าเนื้อหาและคอนเท็นต์ที่อยู่ในหรือปรากฏในบริการ
                    แอพพลิเคชั่น และ/หรือ เว็บไซต์
                    จะไม่สามารถนำไปใช้เพื่อวัตถุประสงค์ในทางการค้าหรือจำหน่ายเพื่อการค้าได้
                  </li>
                  <li>
                    เครื่องหมายทางการค้าทั้งหมดที่ใช้เพื่อระบุถึง อธิบาย
                    หรือแสดงถึงบริการ แอพพลิเคชั่น และ/หรือ เว็บไซต์
                    เป็นเครื่องหมายทางการค้าของ HDPL
                    และไม่มีการให้อนุญาตหรือสิทธิการใช้เครื่องหมายการค้าใดๆ
                    ดังกล่าวโดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจาก HDPL
                    ก่อน
                  </li>
                </ol>
              </li>
            </ol>

            <h2>(C) แอพพลิเคชั่น และเว็บไซต์</h2>
            <ol>
              <li>
                ไฮเปอร์ลิงค์จากเว็บไซต์ของบุคคลที่สาม
                <ol>
                  <li>
                    ท่านตกลงให้การแคชชิ่ง (caching) ไฮเปอร์ลิงค์ (hyperlinking)
                    ซึ่งเชื่อมต่อมายัง และเฟรมมิ่ง (framing) ของแอพพลิเคชั่น
                    หรือเว็บไซต์ หรือคอนเท็นต์ใดๆ
                    ที่แสดงอยู่บนแอพพลิเคชั่นหรือเว็บไซต์
                    เป็นการต้องห้ามโดยเด็ดขาด
                  </li>
                  <li>
                    HDPL มีสิทธิที่จะระงับลิงค์ใดซึ่งเชื่อมต่อมายัง หรือเฟรม
                    (frame) ของเว็บไซต์ใดๆ ซึ่งมีหัวข้อ ชื่อ เนื้อหา
                    หรือข้อมูลที่ไม่เหมาะสม หยาบคาย มีเนื้อหาเป็นการหมิ่นประมาท
                    ละเมิด อนาจาร หรือขัดต่อกฎหมาย
                    หรือมีเนื้อหาหรือข้อมูลซึ่งขัดต่อกฎหมายที่บัญญัติเป็นลายลักษณ์อักษร
                    หรือสิทธิในทรัพย์สินทางปัญญา หรือสิทธิในทางทรัพย์สิน
                    สิทธิส่วนบุคคล หรือสิทธิในการปรากฏต่อสาธารณะ (publicity
                    rights) ที่เกี่ยวข้อง
                  </li>
                </ol>
              </li>
              <li>
                การใช้ข้อมูล คุกกี้ (cookies) และเทคโนโลยีอื่นๆ ของท่าน
                <ol>
                  <li>
                    แอพพลิเคชั่นและเว็บไซต์ถูกออกแบบเพื่อใช้คุกกี้ในการเก็บข้อมูลเกี่ยวกับการใช้แอพพลิเคชั่นและเว็บไซต์ของท่าน
                    ทั้งนี้เว็บบราวเซอร์ส่วนใหญ่ถูกตั้งค่าให้ยอมรับคุกกี้
                    โดยท่านสามารถเลือก ‘ไม่ยอมรับ’
                    คุกกี้โดยเปลี่ยนการตั้งค่าในเว็บบราวเซอร์
                    แต่หากท่านบล็อคคุกกี้ทั้งหมด รวมถึงคุกกี้ที่จำเป็นอย่างยิ่ง
                    (strictly necessary cookies)
                    ท่านอาจพบว่าคุณสมบัติบางประการบนแอพพลิเคชั่นและเว็บไซต์ไม่สามารถทำงานได้ตามปกติ
                  </li>
                  <li>
                    คุกกี้เป็นไฟล์ข้อมูลขนาดเล็กซึ่งจะถูกจัดวางในอุปกรณ์ของท่านเมื่อท่านเข้าเยี่ยมชมบางส่วนของแอพพลิเคชั่นหรือเว็บไซต์
                    หรือคลิกโฆษณาออนไลน์ของเรา โดยคุกกี้และเทคโนโลยีอื่นๆ
                    ถูกใช้เพื่อระบุอุปกรณ์ของท่านเพื่อวัตถุประสงค์ดังต่อไปนี้
                    <ol>
                      <li>
                        คุกกี้ที่จำเป็นอย่างยิ่ง (Strictly necessary cookies)
                        คุกกี้ที่จำเป็นเหล่านี้ถูกติดตั้งทั่วแอพพลิเคชั่นและเว็บไซต์และจำเป็นสำหรับการปฏิบัติการของแอพพลิเคชั่นและเว็บไซต์
                        เพื่อ:
                        <ul>
                          <li>
                            เป็นการชั่วคราว
                            ทำให้ท่านสามารถเคลื่อนย้ายข้อมูลระหว่างหน้าของแอพพลิเคชั่นหรือเว็บไซต์โดยไม่ต้องกรอกข้อมูลดังกล่าวอีกครั้ง
                            และ
                          </li>
                          <li>
                            ทำการระบุอุปกรณ์ของท่านโดยชั่วคราวหลังท่านเข้าระบบไปสู่หน้าที่มีการป้องกันบนแอพพลิเคชั่นหรือเว็บไซต์
                            เพื่อให้เว็บเซอร์เวอร์ของเราสามารถคงไว้ซึ่งข้อความบนเว็บบราวเซอร์ของท่าน
                            เพื่อให้ท่านสามารถทำกิจกรรมบางอย่างได้
                          </li>
                        </ul>
                      </li>
                      <li>
                        คุกกี้เชิงวิเคราะห์/ปฏิบัติการ (Analytical/performance
                        cookies)
                        คุกกี้เหล่านี้ทำหน้าที่ช่วยเหลือเราพัฒนาแอพพลิเคชั่นและเว็บไซต์
                        โดย:
                        <ul>
                          <li>
                            ติดตามการเข้าเยี่ยมชมแอพพลิเคชั่นและเว็บไซต์
                            และจดจำเว็บบราวเซอร์ของท่านเมื่อท่านเข้าเยี่ยมชมอีกครั้ง
                            เพื่อให้เราสามารถรวบรวมสถิติทั้งการเข้าเยี่ยมชมครั้งใหม่และการเข้าเยี่ยมชมซ้ำเพื่อประเมินประสิทธิภาพของไซต์
                          </li>
                        </ul>
                      </li>
                      <li>
                        คุกกี้เพื่อการทำงาน (Functionality cookies)
                        คุกกี้เหล่านี้ทำหน้าที่จดจำท่านเมื่อท่านกลับเข้าใช้แอพพลิเคชั่นและเว็บไซต์
                        โดยการทำหน้าที่เช่นนี้จะทำให้เรา:
                        <ul>
                          <li>
                            คัดกรองคอนเท็นต์ของเราให้ท่านและจดจำความต้องการของท่าน;
                          </li>
                          <li>
                            จัดเก็บล็อกอินและความต้องการอื่นๆ
                            ของท่านเพื่อให้ท่านไม่ต้องใส่ข้อมูลอีกครั้งเมื่อท่านกลับเข้าใช้แอพพลิเคชั่นหรือเว็บไซต์
                            และ
                          </li>
                          <li>
                            คงไว้ซึ่งการควบคุมการเข้าถึงสำหรับท่านเพื่อเข้าเยี่ยมชมหน้าพิเศษโดยที่เราไม่จำเป็นต้องได้รับอนุญาตจากท่านอีก
                            ในกรณีที่ไม่มีการจัดเก็บข้อมูลส่วนตัวใดๆ
                          </li>
                        </ul>
                      </li>
                      <li>
                        เทคโนโลยีเพื่อการติดตาม (Tracking technologies)
                        เทคโนโลยีเพื่อการติดตามจะบันทึกการเข้าเยี่ยมชมแอพพลิเคชั่นและเว็บไซต์ของท่าน
                        ปฏิกิริยาของท่านต่อโฆษณาออนไลน์ของเรา
                        ติดตามหน้าที่ท่านเข้าเยี่ยมชมและลิงค์ของเว็บไซต์ที่ท่านติดตาม
                        โดยเราจะใช้ข้อมูลเหล่านี้เพื่อ:
                        <ul>
                          <li>
                            จัดให้แอพพลิเคชั่นและเว็บไซต์ตรงตามความสนใจของท่านมากขึ้น
                          </li>
                          <li>
                            นำเสนอโฆษณาออนไลน์หรือข้อเสนอบนแอพพลิเคชั่นและเว็บไซต์
                            หรือเว็บไซต์ของบุคคลที่สามซึ่งท่านมีแนวโน้มที่จะให้ความสนใจมากที่สุด
                            และ
                          </li>
                          <li>
                            จำกัดจำนวนการเห็นโฆษณาและประเมินประสิทธิภาพของการตลาดออนไลน์และโปรแกรมการโฆษณาของเรา
                          </li>
                        </ul>
                      </li>
                    </ol>
                  </li>
                </ol>
              </li>
            </ol>
            <h2>(D) ทั่วไป</h2>
            <ol>
              <li>
                ข้อมูลลูกค้า
                <ol>
                  <li>
                    ท่านตกลง ยินยอม และอนุญาตการจัดเก็บ การเอามาซึ่ง การใช้
                    และการเปิดเผย โดยและในนามของ HDPL
                    ซึ่งข้อมูลของลูกค้าไม่ว่าทั้งหมดหรือบางส่วนซึ่งท่านเปิดเผยต่อ
                    HDPL หรือจัดเก็บโดย HDPL (รวมไปถึงข้อมูลใดๆ ซึ่งจัดเก็บ ใช้
                    หรือเปิดเผยตามที่มีการระบุในนโยบายความเป็นส่วนตัวของ HOOQ
                    (HOOQ Privacy Policy)
                    ซึ่งเป็นส่วนหนึ่งของข้อกำหนดทั่วไปโดยการอ้างถึง)
                    ในลักษณะของและเพื่อวัตถุประสงค์ตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวของ
                    HOOQ (HOOQ Privacy Policy)
                    ซึ่งรวมไปถึงวัตถุประสงค์ดังต่อไปนี้:
                    <ol>
                      <li>
                        พิจารณาว่าจะให้บริการซึ่งท่านสมัครเใช้หรือไม่
                        และพิจารณาคำขอสมัครใช้บริการของท่าน
                      </li>
                      <li>
                        จัดการ และ/หรือ บริหารความสัมพันธ์ และ/หรือ
                        บัญชีของท่านกับ HDPL
                        (รวมไปถึงดำเนินการตามคำสั่งของท่านหรือตอบข้อซักถามของท่าน)
                      </li>
                      <li>
                        ดำเนินการพิสูจน์ความถูกต้อง
                        หรืออำนวยความสะดวกด้วยประการอื่นใดในการให้บริการแก่ท่าน
                      </li>
                      <li>
                        จัดการเรื่องใดๆ เกี่ยวกับบริการ
                        (รวมถึงการส่งใบแจ้งหนี้หรือคำบอกกล่าวทางไปรษณีย์แก่ท่าน
                        ซึ่งอาจต้องมีการเปิดเผยข้อมูลส่วนบุคคลบางอย่างเกี่ยวกับท่านเพื่อการจัดส่งดังกล่าว
                        รวมทั้งอาจมีการเปิดเผยข้อมูลส่วนบุคคลบนหน้าซองจดหมายหรือพัสดุไปรษณีย์)
                      </li>
                      <li>
                        ตรวจสอบการฉ้อโกง การกระทำโดยไม่ชอบ
                        การกระทำที่ขัดต่อกฎหมาย หรือการละเลยการปฏิบัติตามกฎหมาย
                        ไม่ว่าจะเกี่ยวข้องกับคำขอสมัครของท่าน
                        ข้อเรียกร้องของท่าน
                        หรือเรื่องอื่นใดซึ่งเกี่ยวข้องกับความสัมพันธ์ของท่าน
                        และ/หรือบัญชีของท่านกับ HDPL
                        โดยไม่ว่าจะมีข้อสงสัยในสิ่งที่กล่าวมาข้างต้นหรือไม่ก็ตาม
                      </li>
                      <li>
                        เพื่อให้เป็นไปตามกฎหมาย ระเบียบ หรือข้อกำหนดอื่นๆ
                        (รวมถึงการเปิดเผยต่อหน่วยงานรัฐ หน่วยงานกำกับดูแล
                        ตลาดหลักทรัพย์ สำนักหักบัญชี หรือผู้รับฝากหลักทรัพย์){' '}
                      </li>
                      <li>
                        นำเสนอข้อมูลแก่ท่าน เสนอผลประโยชน์หรือ loyalty program
                        จัดทำการสำรวจทางการตลาดและการสำรวจอื่นๆ
                        คงไว้ซึ่งการรักษาความปลอดภัย
                        รวมไปถึงเพื่อวัตถุประสงค์อื่นซึ่งระบุไว้เพิ่มเติมในนโยบายความเป็นส่วนตัวของ
                        HOOQ (HOOQ Privacy Policy) และ
                      </li>
                      <li>
                        นำเสนอข้อเสนอ โฆษณา และการส่งเสริมการขายแก่ท่าน
                        ไม่ว่าจะเกี่ยวข้องกับ HOOQ หรือไม่
                        และไม่ว่าจะได้ปรับให้ตรงตามความต้องการของท่าน
                        (personalised) หรือไม่ ทั้งจาก HDPL และคู่ค้าของ HDPL
                        (ต่อไปนี้เรียกรวมกันว่า “<strong>วัตถุประสงค์</strong>")
                      </li>
                    </ol>
                  </li>
                  <p>
                    ความในข้อนี้ให้ถือเป็นความยินยอมเพื่อวัตถุประสงค์ของบทบัญญัติใน
                    Singapore Spam Control Act และกฎหมายอื่นๆ ที่เกี่ยวข้อง
                    เว้นแต่ท่านจะได้แจ้งเป็นลายลักษณ์อักษรเป็นประการอื่นตามกระบวนการตามที่
                    HDPL กำหนดเป็นครั้งเป็นคราว
                  </p>
                  <li>
                    “ข้อมูลลูกค้า” หมายถึง ข้อมูลทั้งหมดซึ่ง HDPL
                    ได้รับจากการใช้บริการของท่าน รวมไปถึงข้อมูลใดๆ
                    ซึ่งเกี่ยวกับธุรกรรม
                    ข้อมูลซึ่งระบุตัวตนหรือข้อมูลซึ่งเกี่ยวกับท่าน
                    ไม่ว่าจะเป็นความจริงหรือไม่ รวมไปถึงข้อมูลใดๆ ซึ่งถูกจัดเก็บ
                    ถูกใช้ หรือถูกเปิดเผยตามที่ได้ระบุในนโยบายความเป็นส่วนตัวของ
                    HOOQ (HOOQ Privacy Policy){' '}
                  </li>
                  <li>
                    ท่านตกลง ยินยอม และอนุญาตให้มีการเปิดเผย
                    และ/หรือโอนย้ายข้อมูลลูกค้าของท่านออกนอกเขตอำนาจตามกฎหมายซึ่งท่านอาศัยอยู่
                    (ในกรณีที่เกี่ยวข้อง) โดยหรือในนามของ HDPL
                    แก่บุคคลที่สามซึ่งเป็นผู้ให้บริการหรือตัวแทนของ HDPL
                    (รวมถึงทนายความของ HDPL)
                    โดยบุคคลดังกล่าวจะดำเนินการใช้ข้อมูลลูกค้าของท่านสำหรับ HDPL
                    เพื่อวัตถุประสงค์ใดๆ
                  </li>
                  <li>
                    ท่านอาจถอนความยินยอมส่วนใดๆ ที่ระบุในข้อนี้โดยยื่นคำร้องขอ
                    (ในรูปแบบและลักษณะตามที่ HDPL กำหนดเป็นครั้งเป็นคราว)
                    เพื่อถอนความยินยอมดังกล่าว{' '}
                  </li>
                  <li>
                    ท่านยินยอมให้ HDPL
                    เก็บรักษาข้อมูลลูกค้าทั้งหมดซึ่งเปิดเผยโดยท่านเพื่อวัตถุประสงค์ในการบริการ
                    และไม่ว่าจะมีการยกเลิกการบริการหรือไม่ HDPL
                    อาจเข้าติดต่อ/ผูกพันกับท่านเกี่ยวกับบริการเป็นครั้งเป็นคราว
                    โดยเป็นไปตามกฎหมายและข้อบังคับที่เกี่ยวข้อง
                  </li>
                </ol>
              </li>
              <li>
                ค่าบริการสำหรับบริการโทรศัพท์เคลื่อนที่
                <ol>
                  <li>
                    ท่านตกลงว่าการใช้บริการโทรศัพท์เคลื่อนที่ใดๆ อาทิ SMS
                    การรับ-ส่งข้อมูล และ/หรือ การโทร
                    อาจมีค่าบริการเพิ่มเติมจากผู้ให้บริการโทรศัพท์/อินเตอร์เน็ต
                    และท่านเป็นผู้รับผิดชอบค่าบริการดังกล่าว (หากมี)
                  </li>
                </ol>
              </li>
              <li>
                การหักกลบลบหนี้
                <ol>
                  <li>
                    โดยไม่เป็นการกระทบต่อและนอกเหนือไปจากสิทธิในการหักกลบลบหนี้ซึ่ง
                    HDPL มีอยู่ด้วยประการอื่นใด HDPL
                    อาจส่งหนังสือบอกกล่าวแก่ท่านเพื่อหักกลบลบหนี้ในจำนวนใดๆ
                    ซึ่งท่านเป็นลูกหนี้ HDPL กับจำนวนที่ HDPL เป็นลูกหนี้ท่าน
                    ทั้งนี้ ภายในขอบเขตที่สามารถทำได้ตามกฎหมายที่เกี่ยวข้อง
                    อย่างไรก็ตาม ในกรณีที่ท่านฝ่าฝืนความข้อใดๆ ในข้อกำหนดทั่วไป
                    HDPL
                    อาจดำเนินการหักกลบลบหนี้โดยไม่จำต้องส่งหนังสือบอกกล่าวถึงท่าน
                  </li>
                </ol>
              </li>
              <li>
                การเลิกสัญญา
                <ol>
                  <li>
                    HDPL สงวนสิทธิทั้งหมด (ตามดุลยพินิจของ HDPL)
                    ในการระงับการให้บริการ
                    (โดยไม่มีกำหนดระยะเวลาหรือตามระยะเวลาที่ HDPL
                    เห็นว่าเหมาะสม) หรือยกเลิกบริการ แอพพลิเคชั่น และ/หรือ
                    เว็บไซต์ หรือส่วนใดส่วนหนึ่งหรือคอนเท็นต์ใดๆ ในนั้น
                    (ทั้งหมดหรือเฉพาะในส่วนของท่าน) ไม่ว่าในเวลาใดๆ
                    โดยมีผลทันทีหรือในวันอื่นใดที่ HDPL
                    จะได้ระบุโดยการแจ้งเป็นลายลักษณ์อักษรให้กับท่านหรือโดยการโพสต์ลงบนแอพพลิเคชั่นและ/หรือเว็บไซต์
                  </li>
                  <li>
                    หากท่านตัดสินใจระงับการรับบริการหรือยกเลิกบริการ
                    ท่านจะต้องส่งคำขอให้กับ HDPL (ในฟอร์มที่ HDPL
                    อาจกำหนดเป็นครั้งเป็นคราว)
                    เพื่อดำเนินการให้การระงับหรือยกเลิกดังกล่าวมีผล
                    ท่านยอมรับและตกลงว่าท่านจะอยู่ภายใต้เงื่อนไขและข้อตกลงที่เกี่ยวข้องสำหรับการระงับหรือยกเลิกดังกล่าว
                  </li>
                  <li>
                    โดยไม่คำนึงถึงข้อสัญญาอื่นใดในที่นี้
                    และโดยไม่เป็นการเสื่อมสิทธิของความในข้อ 4.1 ของ ส่วน (D)
                    HDPL อาจระงับการให้บริการ
                    (โดยไม่มีกำหนดระยะเวลาหรือตามระยะเวลาที่ HDPL
                    เห็นว่าเหมาะสม)
                    หรือยกเลิกการให้บริการกับท่านโดยทันทีโดยการบอกกล่าวเป็นหนังสือไปยังท่าน
                    หาก:
                    <ol>
                      <li>
                        ท่านมี หรือ HDPL
                        มีเหตุที่จะเชื่อได้ว่าท่านได้กระทำผิดข้อสัญญาใดๆ
                        ในข้อกำหนดทั่วไปนี้
                      </li>
                      <li>
                        HDPL
                        มีเหตุที่จะเชื่อได้ว่าท่านได้ใช้หรือน่าจะใช้บริการในทางที่มิชอบ
                        (รวมถึงการใช้โดยไม่ได้รับอนุญาตหรือเพื่อวัตถุประสงค์ที่ผิดกฎหมายหรือเป็นความผิดทางอาญาใดๆ){' '}
                      </li>
                      <li>
                        HDPL
                        จำเป็นต้องดำเนินการดังกล่าวเพื่อให้เป็นไปตามกฎหมายที่เกี่ยวข้องใดๆ
                        หรือแนวทาง คำสั่ง หรือข้อกำหนดใดๆ
                        ของทางการหรือหน่วยงานบังคับใช้กฎหมายใดๆ{' '}
                      </li>
                      <li>
                        ท่านได้ทำหรือน่าจะทำให้เกิดการล้มเหลว การก่อกวน
                        การหยุดชะงัก หรือการติดขัด ของหรือในเครือข่าย ระบบ
                        หรือบริการใดๆ (ไม่ว่าเป็นของ HDPL หรือของบุคคลอื่น)
                        ที่เกี่ยวกับบริการ
                      </li>
                      <li>
                        ในความเห็นของ HDPL ท่านได้กระทำการฉ้ลฉลแก่ HDPL
                        หรือกระทำการในลักษณะที่อาจทำให้เกิด (หรือในความเห็นของ
                        HDPL พยายามที่จะทำให้เกิด) การฉ้อฉลแก่ HDPL หรือ
                      </li>
                      <li>
                        ท่านไม่ให้ความยินยอมหรือถอนความยินยอมที่ท่านให้ไว้ตามข้อ
                        1 ของหมวด D ซึ่งส่งผลให้ HDPL
                        ไม่สามารถให้บริการแก่ท่านต่อได้
                      </li>
                    </ol>
                  </li>
                  <li>
                    ท่านไม่มีสิทธิได้รับการชำระเงิน ค่าชดใช้ หรือค่าเสียหายจาก
                    HDPL จากการยกเลิกการให้บริการแก่ท่าน ทั้งนี้
                    การยกเลิกการให้บริการแก่ท่านไม่เป็นการปลดเปลื้องท่านจากความรับผิดใดๆ
                    ที่มีอยู่แล้ว ณ วันยกเลิกการให้บริการ
                  </li>
                  <li>
                    สิทธิของ HDPL ที่จะระงับหรือยกเลิกการให้บริการ
                    ไม่กระทบต่อสิทธิหรือการเยียวยาอื่นใดที่ HDPL
                    อาจมีภายใต้ข้อกำหนดทั่วไป
                  </li>
                  <li>
                    เมื่อมีการยกเลิกการให้บริการ
                    (ไม่ว่าทั้งหมดหรือเฉพาะในส่วนของท่าน):
                    <ol>
                      <li>
                        สิทธิหรือผลประโยชน์ใดๆ
                        ของท่านในฐานะลูกค้าภายใต้ข้อกำหนดทั่วไปจะสิ้นสุดลงโดยทันที
                      </li>
                      <li>
                        เงินที่ถึงกำหนดชำระหรือต้องชำระให้แก่ HDPL
                        ภายใต้ข้อกำหนดทั่วไปจนกระทั่ง (และรวมถึง)
                        วันที่ยกเลิกบริการทั้งหมด จะถึงกำหนดชำระแก่ HDPL ในทันที
                        และ
                      </li>
                      <li>
                        เว้นแต่กำหนดไว้เป็นอย่างอื่นโดยชัดแจ้ง HDPL
                        หรือท่านจะไม่มีหน้าที่เพิ่มเติมต่ออีกฝ่ายหนึ่งภายใต้ข้อกำหนดทั่วไป
                      </li>
                    </ol>
                  </li>
                </ol>
              </li>
              <li>
                การชดใช้ค่าเสียหาย
                <ol>
                  <li>
                    ภายใต้ขอบเขตที่กฎหมายที่เกี่ยวข้องอนุญาต ท่านจะชดใช้ ป้องกัน
                    และปกป้อง HDPL ผู้ถือหุ้น กรรมการ เจ้าหน้าที่ ลูกจ้าง
                    ผู้จัดหาสินค้า ผู้อนุญาตให้ใช้สิทธิ และตัวแทนของ HDPL
                    และผู้จัดหาคอนเท็นต์ภายนอก (“คู่สัญญาฝ่ายที่ได้รับชดใช้”)
                    จากความสูญเสีย หนี้สิน ต้นทุน
                    (รวมถึงค่าธรรมเนียมทางกฎหมายจนเต็มจำนวน) ค่าเสียหาย
                    ข้อเรียกร้อง ค่าใช้จ่าย การดำเนินการหรือการดำเนินคดีใดๆ
                    ไม่ว่าทั้งหมดหรือแต่บางส่วน
                    ซึ่งอาจถูกยกขึ้นหรือเกิดขึ้นกับคู่สัญญาฝ่ายที่ได้รับชดใช้ใดๆ
                    โดยบุคคลใดๆ หรือที่คู่สัญญาฝ่ายที่ได้รับชดใช้ใดๆ
                    อาจต้องประสบหรือได้รับ (แล้วแต่กรณี)
                    ซึ่งเกิดขึ้นเนื่องจากหรือเกี่ยวข้องกับ:
                    <br />
                    <br />
                    <ol>
                      <li>
                        การใช้บริการ แอพพลิเคชั่น และ/หรือ เว็บไซต์ของท่าน;
                      </li>
                      <li>
                        การฝ่าฝืนข้อกำหนดใดๆ ในข้อกำหนดทั่วไปของท่าน และ/หรือ
                      </li>
                      <li>การละเมิดสิทธิใดๆ ของบุคคลภายนอกโดยท่าน</li>
                      <p>
                        เว้นแต่ความสูญเสีย ค่าเสียหาย ข้อเรียกร้อง ต้นทุน
                        ค่าใช้จ่าย
                        การดำเนินการหรือการดำเนินคดีดังกล่าวเป็นผลโดยตรงและเกิดขึ้นจากการประมาทเลินเล่ออย่างร้ายแรงหรือการจงใจกระทำโดยมิชอบของ
                        HDPL ฝ่ายเดียว
                      </p>
                    </ol>
                  </li>
                  <li>
                    หน้าที่ของท่านภายใต้ข้อนี้จะยังคงอยู่แม้ความสัมพันธ์ระหว่างท่านกับ
                    HDPL หรือการเข้าถึง และ/หรือ การใช้บริการ แอพพลิเคชั่น
                    และ/หรือ เว็บไซต์ของท่านจะสิ้นสุดลงแล้ว ทั้งนี้ HDPL
                    สงวนสิทธิที่จะเข้าสวมสิทธิเพื่อต่อสู้และควบคุมข้อเรียกร้อง
                    คำร้องขอ หรือการดำเนินคดีใดๆ
                    โดยมีสิทธิได้รับการชดใช้ค่าเสียหายจากท่าน
                    และในกรณีดังกล่าวท่านจะให้ความร่วมมือกับ HDPL
                    ในการยืนยันข้อต่อสู้ดังกล่าว
                  </li>
                </ol>
              </li>
              <li>
                ข้อจำกัดของบริการ ข้อยกเว้นและข้อจำกัดความรับผิด
                <ol>
                  <li>
                    ท่านรับทราบและยอมรับว่าการให้บริการ แอพพลิเคชั่น
                    และเว็บไซต์แก่ท่าน
                    ขึ้นอยู่กับความพร้อมที่จะให้บริการและการเชื่อมต่อกับโครงสร้างเครือข่ายพื้นฐานที่เหมาะสม
                    ณ เวลาที่มีการขอใช้หรือให้บริการ
                  </li>
                  <li>
                    ภายใต้ขอบเขตที่กฎหมายที่เกี่ยวข้องอนุญาต
                    ท่านยังรับทราบและยอมรับว่า
                    <ol>
                      <li>
                        โดยไม่เป็นการเสื่อมสิทธิในข้อ 6.4 ของหมวด D HDPL
                        ประสงค์โดยชัดแจ้งที่จะไม่รวมการประกัน (guarantee)
                        คำรับรอง คำรับประกัน เงื่อนไข ข้อกำหนด
                        หรือข้อกำหนดหน้าที่ใดๆ
                        (รวมถึงคำรับประกันการไม่ละเมิดสิทธิในทรัพย์สินทางปัญญา)
                        ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย
                        ตามที่กฎหมายกำหนดหรือตามอื่นใด
                        หรือคำรับรองหรือคำรับประกันที่เกิดจากการใช้
                        ธรรมเนียมปฏิบัติ การค้า หรือโดยผลของกฎหมาย
                        ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะลำดับต่อเนื่อง ความริเริ่ม
                        ความถูกต้อง ความสมบูรณ์ ความแม่นยำ การสามารถวางตลาดได้
                        (merchantability)
                        หรือความเหมาะสมสำหรับวัตถุประสงค์ใดโดยเฉพาะ
                        ซึ่งเกี่ยวข้องหรือเกิดจากการใช้บริการ แอพพลิเคชั่น
                        และ/หรือ เว็บไซต์
                      </li>
                      <li>
                        HDPL ไม่ต้องรับผิดต่อท่านประการใดๆ
                        ไม่ว่าทั้งหมดหรือแต่บางส่วน สำหรับความสูญเสีย หนี้สิน
                        ต้นทุน ค่าเสียหาย ข้อเรียกร้อง ค่าใช้จ่าย หรือค่าชดเชย
                        (รวมถึงการคืนเงิน) ใดๆ (ไม่ว่าโดยตรง โดยอ้อม
                        หรือที่เป็นผลต่อเนื่อง
                        (รวมถึงค่าเสียหายซึ่งเกิดขึ้นจากการโจมตีทางไซเบอร์))
                        ในเรื่องใดๆ
                        ที่เกิดขึ้นไม่ว่าในลักษณะใดและจะเกิดขึ้นอย่างไร
                        (ไม่ว่าตามสัญญา การละเมิด ความประมาทเลินเล่อ หรืออื่นใด)
                        ซึ่งเกี่ยวข้องกับ
                        <ul>
                          <li>
                            การดาวน์โหลดซอฟต์แวร์หรือคอนเท็นต์ใดๆ จากบริการ
                            แอพพลิเคชั่น และ/หรือ เว็บไซต์;
                          </li>
                          <li>
                            การจัดให้มีและการใช้บริการ แอพพลิเคชั่น และ/หรือ
                            เว็บไซต์ (รวมถึงการใช้ และ/หรือ การเข้าถึงบริการ
                            แอพพลิเคชั่น และ/หรือ เว็บไซต์โดยไม่ได้รับอนุญาต);
                          </li>
                          <li>
                            ข้อบกพร่อง ข้อผิดพลาด ความล้มเหลว การก่อกวนต่อ
                            หรือการขัดขวางใดๆ ของบริการ แอพพลิเคชั่น และ/หรือ
                            เว็บไซต์ และ/หรือ
                          </li>
                          <li>
                            การระงับ การยกเลิก หรือการสิ้นสุดของบริการ
                            แอพพลิเคชั่น และ/หรือ เว็บไซต์{' '}
                          </li>
                          <li>
                            เว้นแต่ความสูญเสียหรือค่าเสียหายดังกล่าวเป็นผลโดยตรงจากการฉ้อฉล
                            การประมาทเลินเล่ออย่างร้ายแรง
                            หรือการจงใจกระทำโดยมิชอบของ HDPL
                          </li>
                        </ul>
                      </li>
                      <li>
                        HDPL ไม่ต้องรับผิดต่อท่านประการใดๆ
                        ไม่ว่าทั้งหมดหรือแต่บางส่วน สำหรับความสูญเสีย หนี้สิน
                        ต้นทุน ค่าเสียหาย ข้อเรียกร้อง ค่าใช้จ่าย หรือค่าชดเชย
                        (รวมถึงการคืนเงิน) ใดๆ (ไม่ว่าโดยตรง โดยอ้อม
                        หรือที่เป็นผลต่อเนื่อง
                        (รวมถึงค่าเสียหายซึ่งเกิดขึ้นจากการโจมตีทางไซเบอร์))
                        ในเรื่องใดๆ
                        ที่เกิดขึ้นไม่ว่าในลักษณะใดและจะเกิดขึ้นอย่างไร
                        (ไม่ว่าตามสัญญา การละเมิด ความประมาทเลินเล่อ หรืออื่นใด)
                        ซึ่งเกี่ยวข้องกับ
                        <ul>
                          <li>
                            การละเลย ข้อบกพร่อง หรือข้อผิดพลาดใดๆ ของคอนเท็นต์
                            ผลิตภัณฑ์ หรือบริการใดๆ
                            บนเว็บไซต์ของบุคคลภายนอกซึ่งเข้าผ่านบริการ
                            แอพพลิเคชั่น และ/หรือ เว็บไซต์ และ/หรือ
                          </li>
                          <li>
                            การกระทำหรือการละเลยใดๆ
                            ของร้านค้าแอพพลิเคชั่นโทรศัพท์มือถือของบุคคลภายนอก
                            ซึ่งเกี่ยวข้องกับการจัดจำหน่ายแอพพลิเคชั่น
                          </li>
                        </ul>
                      </li>
                    </ol>
                  </li>
                  <li>
                    ในกรณีที่ข้อจำกัดความรับผิดข้างต้นไม่สามารถทำได้ภายใต้กฎหมายที่เกี่ยวข้อง
                    ความรับผิดของ HDPL ที่มีต่อท่าน ไม่ว่าตามสัญญา การละเมิด
                    (รวมถึงการประมาทเลินเล่อหรือผิดหน้าที่ตามกฎหมาย) หรืออื่นใด
                    สำหรับความสูญเสีย ค่าเสียหาย
                    หรือความรับผิดไม่ว่าทั้งหมดหรือแต่บางส่วนซึ่งเกิดขึ้นจากหรือเกี่ยวเนื่องกับการใช้บริการ
                    แอพพลิเคชั่น และ/หรือ เว็บไซต์ของท่าน
                    หรือเนื่องจากเหตุอื่นใดซึ่งเกี่ยวเนื่องกับข้อกำหนดทั่วไป
                    จะไม่เกินกว่าจำนวนรวมทั้งหมดที่ท่านชำระให้แก่ HDPL ณ
                    เวลาหลักที่เกิดความสูญเสีย
                    หรือไม่เกินกว่าจำนวนความสูญเสียหรือความเสียหายที่แท้จริง
                    แล้วแต่จำนวนใดจะต่ำกว่า
                  </li>
                  <li>
                    ภายใต้ขอบเขตที่กฎหมายที่เกี่ยวข้องอนุญาต HDPL
                    ไม่ได้รับประกันหรือให้คำรับรองใดๆ ว่า
                    <ol>
                      <li>
                        บริการ แอพพลิเคชั่น และ/หรือ
                        เว็บไซต์จะสอดคล้องกับความต้องการของท่าน
                      </li>
                      <li>
                        บริการ แอพพลิเคชั่น และ/หรือ เว็บไซต์จะมีอยู่
                        สามารถเข้าถึงได้ สามารถใช้งาน
                        หรือทำงานร่วมกันตลอดเวลากับเครือข่ายโทรศัพท์มือถือ
                        โครงสร้างเครือข่ายพื้นฐาน ระบบหรือสิ่งอื่นใด
                        หรือบริการอื่นใดที่ HDPL อาจนำเสนอเป็นครั้งเป็นคราว
                        และ/หรือ
                      </li>
                      <li>
                        การเข้าถึงหรือการใช้บริการ แอพพลิเคชั่น และ/หรือ
                        เว็บไซต์ของท่านจะไม่ถูกขัดขวาง ไม่ล่าช้า ปลอดภัย
                        หรือไม่มีข้อผิดพลาด
                      </li>
                    </ol>
                  </li>
                </ol>
              </li>
              <li>
                การแก้ไขและการเปลี่ยนแปลง
                <ol>
                  <li>
                    HDPL สงวนสิทธิที่จะแก้ไข ปรับปรุง เพิ่มเติม
                    หรือเปลี่ยนแปลงใดๆ ซึ่งข้อกำหนดทั่วไป
                    (รวมถึงการแก้ไขนโยบายความเป็นส่วนตัวของ HOOQ (HOOQ Privacy
                    Policy)) เป็นครั้งเป็นคราว โดยส่งคำบอกกล่าวล่วงหน้าเจ็ด (7)
                    วันถึงท่าน โดยให้การแก้ไข ปรับปรุง
                    หรือเพิ่มเติมดังกล่าวมีผลนับแต่วันที่ระบุในคำบอกกล่าวดังกล่าว
                    ทั้งนี้ ให้ถือว่าคำบอกกล่าวของ HDPL
                    ที่โพสต์ลงบนแอพพลิเคชั่นและ/หรือเว็บไซต์
                    หรือวิธีการอื่นใดตามที่ HDPL เห็นว่าเหมาะสม
                    เป็นคำบอกกล่าวที่เหมาะสมและเพียงพอจาก HDPL ถึงท่าน
                    โดยให้ถือว่าท่านได้รับคำบอกกล่าวดังกล่าว ณ
                    วันที่โพสต์หรือวันอื่นใด ตามแต่กรณี
                    ในกรณีที่มีการบอกกล่าวตามวิธีการอื่นใด นอกจากนี้
                    การที่ท่านยังคงใช้บริการ แอพพลิเคชั่น และ/หรือ
                    เว็บไซต์อย่างต่อเนื่อง
                    ให้ถือว่าท่านได้ให้ความยินยอมในการแก้ไข ปรับปรุง
                    หรือเปลี่ยนแปลงซึ่งข้อกำหนดทั่วไปดังกล่าว
                    และท่านตกลงผูกพันตามข้อกำหนดทั่วไปฉบับแก้ไขดังกล่าว
                  </li>
                </ol>
              </li>
              <li>
                การสละสิทธิ
                <ol>
                  <li>
                    การที่ HDPL ไม่ได้ใช้สิทธิหรือบังคับสิทธิใดๆ
                    ภายใต้ข้อกำหนดทั่วไป และการใช้สิทธิหรือบังคับสิทธิใดๆ
                    ภายใต้ข้อกำหนดทั่วไปโดยล่าช้า
                    ไม่เป็นการสละสิทธิการใช้สิทธิหรือบังคับสิทธิของ HDPL
                    ดังกล่าว
                    และมิให้ถือว่าการไม่ใช้สิทธิหรือการล่าช้าในการใช้สิทธิดังกล่าวกระทบต่อสิทธิของ
                    HDPL ในเวลาใดๆ
                  </li>
                </ol>
              </li>
              <li>
                การโอน
                <ol>
                  <li>
                    ท่านตกลงจะไม่โอน หรือก่อภาระผูกพันบนสิทธิ ผลประโยชน์
                    และหน้าที่ของท่านภายใต้ข้อกำหนดทั่วไปไม่ว่าทั้งหมดหรือแต่บางส่วน
                    เว้นแต่ HDPL ให้ความยินยอมเป็นลายลักษณ์อักษรเป็นการล่วงหน้า
                    ทั้งนี้ ท่านยินยอมว่า HDPL อาจโอนสิทธิ ผลประโยชน์
                    หรือหน้าที่ของ HDPL
                    ภายใต้ข้อกำหนดทั่วไปไม่ว่าทั้งหมดหรือแต่บางส่วนให้แก่บุคคลอื่นได้ตามดุลยพินิจของ
                    HDPL โดยไม่ต้องได้รับความยินยอมหรือความตกลงจากท่าน
                    โดยให้การโอนสิทธิดังกล่าวมีผลเมื่อได้มีการโพสต์ลงบนแอพพลิเคชั่นและ/หรือเว็บไซต์
                    หรือตามวันที่ระบุ
                  </li>
                </ol>
              </li>
              <li>
                คำบอกกล่าวและการติดต่อสื่อสาร
                <ol>
                  <li>
                    HDPL อาจส่งคำบอกกล่าวและการสื่อสารใดๆ ถึงท่านทาง email SMS
                    หรือวิธีการอื่นใดตามที่ HDPL เห็นว่าเหมาะสม ทั้งนี้
                    สำหรับการส่งคำบอกกล่าว คำเรียกร้อง หรือการสื่อสารถึงท่านทาง
                    email SMS หรือทางอิเล็กทรอนิกส์โดยพลัน
                    ให้ถือว่าท่านได้รับโดยทันทีเมื่อส่งออกโดย HDPL
                  </li>
                  <li>
                    เว้นแต่ HDPL จะระบุเป็นอย่างอื่น
                    คำบอกกล่าวและคำร้องขอจากท่านมายัง HDPL ต้องทำเป็นหนังสือ โดย
                    HDPL มีสิทธิถือว่าคำบอกกล่าวหรือคำร้องขอใดๆ
                    จากท่านยังไม่มีผล หาก HDPL ไม่ได้ยืนยันการรับแก่ท่าน
                  </li>
                </ol>
              </li>
              <li>
                การมีผลแยกส่วน
                <ol>
                  <li>
                    หากข้อกำหนดใดๆ ในข้อกำหนดทั่วไป ไม่สมบูรณ์ ไม่มีผลใช้บังคับ
                    หรือขัดต่อกฎหมาย ให้ใช้บังคับข้อกำหนดนั้นๆ เท่าที่จะทำได้
                    โดยให้มีผลแยกส่วนและไม่ส่งผลกระทบต่อการมีผลใช้บังคับของข้อกำหนดอื่นๆ
                    ในข้อกำหนดทั่วไป
                    ซึ่งให้มีผลใช้บังคับมากที่สุดเท่าที่อนุญาตโดยกฎหมาย
                  </li>
                </ol>
              </li>
              <li>
                สิทธิของบุคคลภายนอก
                <ol>
                  <li>
                    บุคคลอื่นใดที่ไม่ใช่คู่สัญญาของข้อกำหนดทั่วไป ไม่มีสิทธิใดๆ
                    ภายใต้บท 53B ของพระราชบัญญัติว่าด้วยสัญญา
                    (เพื่อสิทธิของบุคคลภายนอก) ของประเทศสิงคโปร์
                    ที่จะบังคับหรือใช้ประโยชน์ของข้อกำหนดใดๆ ในข้อกำหนดทั่วไป
                  </li>
                </ol>
              </li>
              <li>
                เหตุสุดวิสัย
                <ol>
                  <li>
                    HDPL ไม่ต้องรับผิดต่อท่านหรือถือว่าผิดข้อกำหนดทั่วไป
                    ในกรณีที่ HDPL
                    ไม่สามารถปฏิบัติหน้าที่หรือปฏิบัติหน้าที่ล่าช้า
                    หากการไม่ปฏิบัติหน้าที่หรือความล่าช้าดังกล่าวเกิดขึ้นเนื่องจากเหตุสุดวิสัย
                    ทั้งนี้ เหตุสุดวิสัย หมายถึง เหตุการณ์หรือพฤติการณ์
                    (ซึ่งรวมถึงการล่มของเครือข่ายหรือช่วงเวลาที่ระบบที่เกี่ยวข้องกับบริการไม่ทำงาน
                    (system downtime)) ซึ่ง HDPL
                    ไม่อาจป้องกันหรือหลีกเลี่ยงการเกิดขึ้นและผลของเหตุการณ์หรือพฤติการณ์ดังกล่าวได้
                    แม้ HDPL จะได้คาดการณ์และใช้ความระมัดระวังตามสมควรแล้วก็ตาม
                  </li>
                </ol>
              </li>
            </ol>
            <hr />
            <p>
              ข้อกำหนดและเงื่อนไขทั่วไปของ HOOQ มีผลใช้บังคับวันที่ 14
              กุมภาพันธ์ 2560
            </p>
            <p className="bold">
              สงวนลิขสิทธิ์ © HOOQ DIGITAL PTE. LTD. 2015. ห้ามลอกเลียนแบบ
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};
