export default () => {
  return (
    <div className="privacy-policy">
      <p>
        นโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ (&ldquo;นโยบาย&rdquo;) อธิบายว่า แกร็บ
        โฮลดิ้ง อิงค์ และบริษัทลูก บริษัทที่เกี่ยวข้องกัน
        และบริษัทที่อยู่ภายใต้การควบคุมเดียวกัน (&ldquo;กลุ่มบริษัทแกร็บ&rdquo;)
        ใช้ข้อมูลส่วนบุคคลของท่านอย่างไร
      </p>
      <p>
        <strong>การเก็บรวบรวมข้อมูลส่วนบุคคล</strong>
      </p>
      <p>
        &ldquo;ข้อมูลส่วนบุคคล&rdquo; หมายถึง ข้อมูลของท่าน
        ที่สามารถระบุตัวตนของท่านได้ รวมถึงโดยไม่จำกัดเฉพาะ ชื่อ สัญชาติ ที่อยู่
        หมายเลขโทรศัพท์ หมายเลขโทรสาร รายละเอียดของธนาคาร รายละเอียดบัตรเครดิต
        เพศ สถานะด้านถิ่นที่อยู่ ประวัติทางการเงิน ความสนใจส่วนบุคคล
        ที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (email address) อาชีพของท่าน
        ภาพถ่ายของท่าน ข้อมูลใด ๆ เกี่ยวกับท่าน
        ซึ่งท่านได้ให้ข้อมูลดังกล่าวแก่กลุ่มบริษัทแกร็บในแบบฟอร์มลงทะเบียน
        ใบสมัคร หรือแบบฟอร์มอื่นใดที่คล้ายคลึงกัน และ/หรือข้อมูลใดๆ
        เกี่ยวกับท่านซึ่งถูกหรืออาจถูกเก็บ รวบรวม เก็บรักษา ใช้
        และประมวลผลโดยกลุ่มบริษัทแกร็บเป็นครั้งคราว
        และรวมถึงข้อมูลส่วนบุคคลที่มีความละเอียดอ่อน เช่น หมายเลขบัตรประจำตัว
        หมายเลขใบอนุญาตขับขี่ หมายเลขสูติบัตร หมายเลขหนังสือเดินทาง เชื้อชาติ
        เชื้อสายชาติพันธุ์ วันเกิด สถานะการสมรส ประวัติทางการศึกษา
        และข้อมูลด้านสุขภาพ ศาสนา หรือความเชื่ออื่นๆ ในลักษณะเดียวกัน ทั้งนี้
        ในกรณีที่ท่านเป็นผู้ให้บริการ แกร็บอาจเก็บข้อมูลเทเลแมติกส์ (telematics)
        ด้วย (เช่น ข้อมูลความเร็ว อัตราการเร่ง และการเบรกรถ)
        ข้อมูลเกี่ยวกับอุปกรณ์สื่อสาร (เช่น หมายเลข IMEI
        ของเครื่องโทรศัพท์เคลื่อนที) และข้อมูลการจดทะเบียนยานพาหนะ
      </p>
      <p>
        ท่านได้ให้ข้อมูลส่วนบุคคลไว้โดยสมัครใจ อย่างไรก็ดี
        หากท่านไม่ให้ข้อมูลส่วนบุคคลของท่านแก่กลุ่มบริษัทแกร็บ
        กลุ่มบริษัทแกร็บจะไม่สามารถประมวลผลข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ที่กำหนดและวัตถุประสงค์เพิ่มเติมที่กำหนดตามรายละเอียดที่ระบุไว้ด้านล่างนี้
        และอาจส่งผลให้กลุ่มบริษัทแกร็บไม่สามารถให้บริการหรือนำเสนอผลิตภัณฑ์แก่ท่านหรือรับชำระเงินจากท่านได้
      </p>
      <p>
        หากท่านเป็นตัวแทน ผู้ขาย ผู้จัดหา (supplier) หรือผู้ให้บริการ
        ท่านต้องให้ข้อมูลส่วนบุคคลของท่าน
        หากท่านไม่ให้ข้อมูลส่วนบุคคลของท่านอาจถือเป็นการฝ่าฝืนข้อกำหนดแห่งกฎหมายและระเบียบที่เกี่ยวข้อง
        ซึ่งอาจส่งผลให้กลุ่มบริษัทแกร็บไม่สามารถว่าจ้างให้ท่านให้บริการหรือนำเสนอผลิตภัณฑ์
        หรือชำระเงินให้แก่ท่านสำหรับผลิตภัณฑ์หรือบริการที่ท่านขาย/ให้บริการแก่กลุ่มบริษัทแกร็บได้
      </p>
      <p>
        นอกจากข้อมูลส่วนบุคคลที่ท่านให้แก่กลุ่มบริษัทแกร็บโดยตรง
        กลุ่มบริษัทแกร็บอาจเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจากแหล่งข้อมูลที่มีการเปิดเผยโดยทั่วไป
        หรือจากแหล่งข้อมูลอื่นๆ เช่น
      </p>
      <ul>
        <li>
          จากใบสมัครหรือแบบฟอร์มลงทะเบียนที่กรอกข้อมูลแล้ว แบบสำรวจ
          หรือเอกสารอื่นใดที่ใช้ในการอบรม หรือแบบฟอร์มอื่นใดที่คล้ายคลึงกัน
        </li>
        <li>
          จากแหล่งที่มาสาธารณะ เช่น ระบบที่รวบรวมข้อมูลต่างๆ ไว้ (directories)
        </li>
        <li>
          จากเพจทางการของกลุ่มบริษัทแกร็บบนสื่อสังคมออนไลน์ (social media)
          หากท่านได้กดติดตาม ชอบ หรือเป็นแฟนเพจดังกล่าว
        </li>
        <li>
          จากบริษัทรายงานข้อมูลเครดิต ผู้ให้บริการด้านการประกันภัย
          หรือผู้ให้บริการทางการเงิน
        </li>
        <li>
          เมื่อท่านมีปฏิสัมพันธ์หรือติดต่อกับกลุ่มบริษัทแกร็บในงานหรือกิจกรรมใด
          ๆ
        </li>
        <li>เมื่อท่านเข้าร่วมการประกวดที่จัดโดยกลุ่มบริษัทแกร็บ</li>
        <li>จากหน่วยงานหรือแผนกต่าง ๆ ภายใต้กลุ่มบริษัทแกร็บ</li>
        <li>
          จากนิติบุคคลอื่นๆ ที่เป็นผู้ให้บริการแก่ท่านหรือนิติบุคคลอื่นๆ
          ที่ท่านได้เข้าทำสัญญาด้วย
        </li>
        <li>จากผู้ให้บริการทางการตลาด หรือคู่ค้า</li>
        <li>
          จากการใช้แอปพลิเคชันและเว็บไซต์
          ซึ่งรวมถึงแอปพลิเคชันและเว็บไซต์ทั้งหมดที่ดำเนินการโดยกลุ่มบริษัทแกร็บและอยู่ภายใต้ชื่อ
          <br />
          แบรนด์สินค้าต่าง ๆ ของกลุ่มบริษัทแกร็บ (&ldquo;แอปพลิเคชัน&rdquo; และ
          &ldquo;เว็บไซต์&rdquo; ตามลำดับ)
        </li>
      </ul>
      <p>
        ข้อมูลส่วนบุคคลของท่านอาจถูกจัดเก็บจากคุ้กกี้ (cookies) ที่ใช้บนเว็บไซต์
        และกรณีที่ท่านเป็นผู้ให้บริการ
        ข้อมูลของท่านอาจถูกรวบรวมจากข้อมูลมาตรความเร่ง (accelerometer data)
        ข้อมูลจีพีเอส ข้อมูลจากอุปกรณ์เครื่องมือสื่อสาร
        และข้อมูลที่จัดเก็บเมื่อมีการแอปพลิเคชันแกร็บสำหรับคนขับรถ
      </p>
      <p>
        นอกจากนี้
        ผู้ให้บริการบางรายของกลุ่มบริษัทแกร็บอาจใช้กล้องส่วนตัวภายในรถยนต์เพื่อประโยชน์แห่งความปลอดภัยและความมั่นคงของตน
        อย่างไรก็ดี
        กลุ่มบริษัทแกร็บไม่มีส่วนเกี่ยวข้องในการสนับสนุนหรือห้ามไม่ให้มีการใช้งานกล้องส่วนตัวภายในรถยนต์นั้นๆ&nbsp;
        ซึ่งกลุ่มบริษัทแกร็บจะไม่จัดเก็บ ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลใดๆ
        ของท่านที่ได้มาจากการบันทึกโดยกล้องส่วนตัวภายในของรถยนต์ดังกล่าว
        และจะไม่มีการจัดเก็บ
        ใช้และเปิดเผยข้อมูลส่วนบุคคลดังกล่าวในนามของกลุ่มบริษัทแกร็บ ทั้งนี้
        การจัดเก็บ
        ใช้และเปิดเผยข้อมูลส่วนบุคคลที่ได้รับจากกล้องส่วนตัวภายในรถยนต์เป็นความรับผิดชอบของผู้ให้บริการแต่เพียงผู้เดียว
        และท่านควรแจ้งผู้ให้บริการของท่านทราบหากท่านไม่ยินยอมให้มีการใช้งานกล้องส่วนตัวภายในรถยนต์คันดังกล่าวในขณะที่ท่านโดยสารอยู่
      </p>
      <p>
        <strong>วัตถุประสงค์ในการประมวลผล</strong>
      </p>
      <p>
        กลุ่มบริษัทแกร็บอาจใช้และประมวลผลข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ทางธุรกิจ
        การคมนาคม การจัดส่ง และโลจิสติกส์ (รวมถึงอาหารและเครื่องดื่ม)
        และการให้บริการชำระเงินและการให้บริการทางการเงินของกลุ่มบริษัทแกร็บ
        รวมถึงโดยไม่จำกัดเฉพาะวัตถุประสงค์ดังต่อไปนี้
        (&ldquo;วัตถุประสงค์ที่กำหนด&rdquo;)
      </p>
      <p>ในกรณีที่ท่านเป็นลูกค้าของการให้บริการโดยกลุ่มบริษัทแกร็บ</p>
      <ul>
        <li>
          เพื่อปฏิบัติหน้าที่ของกลุ่มบริษัทแกร็บตามสัญญาที่ได้ทำไว้กับท่าน
        </li>
        <li>เพื่อให้บริการแก่ท่านตามที่ท่านร้องขอ</li>
        <li>เพื่อประมวลผลการสมัครใช้บริการ และให้บริการแก่ท่าน</li>
        <li>
          หากท่านได้ดาวน์โหลดและใช้แอปพลิเคชันแกร็บหรือแอปพลิเคชันแกร็บสำหรับคนขับรถ
          หรือแอปพลิเคชันอื่นใดของกลุ่มบริษัทแกร็บ เพื่อประมวลผลคำขอ
          และจัดส่งแอปพลิเคชันให้แก่ท่าน
          และอนุญาตให้ท่านมีสิทธิในการใช้แอปพลิเคชันดังกล่าว
        </li>
        <li>เพื่อประมวลผลและบริหารจัดการรางวัลและคะแนนสะสมของท่าน</li>
        <li>
          เพื่อประมวลผลการเข้าร่วมงาน กิจกรรม การสนทนากลุ่ม (focus group)
          การศึกษาวิจัย การแข่งขัน การส่งเสริมการขาย การทำประชามติ การสำรวจ
          หรือการผลิตใด ๆ
        </li>
        <li>
          เพื่อประมวลผล บริหารจัดการ
          หรือตรวจสอบใบสมัครเพื่อขอรับบริการจากกลุ่มบริษัทแกร็บ
          และเพื่อมอบสิทธิประโยชน์สำหรับผู้ใช้บริการให้แก่ท่าน
        </li>
        <li>
          เพื่อทำให้การจองของท่านมีผลสมบูรณ์และประมวลผลการชำระเงินที่เกี่ยวข้องกับผลิตภัณฑ์หรือบริการใดๆ
          ที่ท่านร้องขอ
        </li>
        <li>
          เพื่อทำความเข้าใจและวิเคราะห์การขายของกลุ่มบริษัทแกร็บ
          รวมถึงความต้องการและรสนิยมของท่าน
        </li>
        <li>
          เพื่อพัฒนา ปรับปรุง
          และมอบผลิตภัณฑ์และให้บริการได้ตรงตามความต้องการของท่าน
        </li>
        <li>เพื่อประมวลผลการแลกเปลี่ยนหรือคืนผลิตภัณฑ์</li>
        <li>
          เพื่อใช้คุกกี้ (cookies) ในการปรับปรุงการประมวลผล การโฆษณา
          การแจ้งเตือน การพิสูจน์ตัวตน (authentication) ความมั่นคงปลอดภัย
          และการปฏิบัติตามกฎระเบียบ การวิเคราะห์ และการบริหารจัดการความชอบต่างๆ
          ของท่าน
        </li>
      </ul>
      <p>
        ในกรณีที่ท่านเป็นตัวแทน ผู้ขาย ผู้จัดหา (supplier)&nbsp; คู่ค้า
        ผู้รับจ้าง หรือผู้ให้บริการ
      </p>
      <ul>
        <li>
          เพื่อวัตถุประสงค์ในการว่าจ้างเพื่อให้ท่านสามารถให้บริการหรือนำเสนอผลิตภัณฑ์ได้
        </li>
        <li>
          เพื่ออำนวยความสะดวกหรือทำให้สามารถทำการตรวจสอบใด ๆ
          ตามที่กลุ่มบริษัทแกร็บอาจกำหนดเพื่อว่าจ้างท่านในการให้บริการหรือนำเสนอผลิตภัณฑ์
        </li>
        <li>
          เพื่อประมวลผลการชำระเงินที่เกี่ยวข้องกับผลิตภัณฑ์หรือบริการที่ท่านได้จัดเตรียมหรือให้บริการ
        </li>
        <li>
          เพื่อให้ความคิดเห็นต่อผลิตภัณฑ์ และ/หรือบริการแก่ท่าน
          เพื่อให้ท่านสามารถนำความคิดเห็นดังกล่าวไปปรับปรุงคุณภาพของผลิตภัณฑ์หรือบริการ
        </li>
        <li>เพื่อประเมินความปลอดภัยและคุณภาพ</li>
        <li>
          เพื่อกำกับดูแลการปฏิบัติตามเงื่อนไขและข้อกำหนด นโยบาย
          และจรรยาบรรณของคนขับรถของกลุ่มบริษัทแกร็บ
        </li>
        <li>เพื่อปรับปรุงข้อมูลให้เป็นปัจจุบัน</li>
        <li>
          เพื่อวัตถุประสงค์ในการบริหาร จัดการตัวแทน ผู้ขาย ผู้จัดหา
          (supplier)&nbsp; คู่ค้า ผู้รับจ้าง หรือผู้ให้บริการ
        </li>
        <li>
          เพื่อติดต่อท่านเกี่ยวกับการนำเสนอผลิตภัณฑ์ และ/หรือการให้บริการของท่าน
        </li>
      </ul>
      <p>
        <strong>ทั่วไป</strong>
        <strong>:</strong>
      </p>
      <ul>
        <li>เพื่อตอบคำถาม ข้อคิดเห็น และคำติชมที่ได้รับจากท่าน</li>
        <li>เพื่อสื่อสารกับท่านเพื่อวัตถุประสงค์ใดๆ ที่ระบุไว้ในประกาศนี้</li>
        <li>
          เพื่อการบริหารจัดการภายใน เช่น การสอบบัญชี การวิเคราะห์ข้อมูล
          และการบันทึกลงฐานข้อมูล
        </li>
        <li>เพื่อวัตถุประสงค์ในการตรวจสอบ ป้องกัน และดำเนินคดีตามกฎหมาย</li>
        <li>เพื่อรักษาความปลอดภัยและความมั่นคงในการให้บริการของเรา</li>
        <li>เพื่อให้กลุ่มบริษัทแกร็บสามารถปฏิบัติตามหน้าที่ตามกฎหมาย</li>
      </ul>
      <p>
        และท่านตกลงและยินยอมให้กลุ่มบริษัทแกร็บใช้และประมวลผลข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ที่กำหนดในลักษณะที่กำหนดไว้ในนโยบายนี้
      </p>
      <p>
        <strong>วัตถุประสงค์ด้านการตลาดและการส่งเสริมการขาย</strong>
        <br />
        กลุ่มบริษัทแกร็บอาจใช้และประมวลผลข้อมูลของท่านเพื่อวัตถุประสงค์อื่น ๆ
        เช่น (&ldquo;วัตถุประสงค์เพิ่มเติมที่กำหนด&rdquo;)
      </p>
      <ul>
        <li>
          เพื่อส่งข้อความเตือน จดหมายข่าว อัพเดท
          จดหมายหรือห่อของที่ส่งทางไปรษณีย์ (mailers)
          สื่อที่ใช้ในการส่งเสริมการขาย สิทธิประโยชน์พิเศษ
          คำอวยพรเนื่องในโอกาสพิเศษจากกลุ่มบริษัทแกร็บ คู่ค้า ผู้สนับสนุน
          หรือผู้โฆษณา
        </li>
        <li>
          เพื่อแจ้งและเชิญท่านให้เข้าร่วมงานหรือกิจกรรมที่จัดโดยกลุ่มบริษัทแกร็บ
          คู่ค้า ผู้สนับสนุน หรือผู้โฆษณา
        </li>
        <li>
          เพื่อประมวลผลการลงทะเบียนขอมีส่วนร่วมหรือเข้าร่วมงานหรือกิจกรรม
          และเพื่อสื่อสารกับท่านเกี่ยวกับการร่วมงานหรือกิจกรรมของท่าน
        </li>
        <li>
          เพื่อเปิดเผยข้อมูลส่วนบุคคลของท่านระหว่างบริษัทลูก
          บริษัทที่เกี่ยวข้องกัน และบริษัทที่อยู่ภายใต้ความควบคุมเดียวกัน
          รวมถึงตัวแทน ผู้ขาย ผู้จัดหา (supplier) คู่ค้า ผู้รับจ้าง
          หรือผู้ให้บริการของบุคคลข้างต้น ซึ่งอาจสื่อสารกับท่านเพื่อทำการตลาด
          โฆษณาผลิตภัณฑ์ บริการ การจัดงาน หรือการส่งเสริมการขาย
        </li>
      </ul>
      <p>
        ทั้งนี้ การทำการตลาดและการส่งเสริมการขายอาจทำได้ผ่านทางไปรษณีย์ โทรศัพท์
        การให้บริการข้อความสั้น (SMS) การให้บริการส่งข้อความออนไลน์
        การส่งถึงตัวบุคคล และ/หรือการส่งไปรษณีย์อิเล็กทรอนิกส์ (email)
      </p>
      <p>
        <strong>การบอกเลิกใช้บริการ และเพิกถอนการให้ความยินยอม</strong>
      </p>
      <p>
        หากท่านประสงค์ที่จะบอกเลิกใช้บริการการประมวลผลข้อมูลส่วนบุคคลของท่านสำหรับวัตถุประสงค์เพิ่มเติมที่กำหนดโดยกลุ่มบริษัทแกร็บ
        ให้ท่านกดที่ลิงค์ &ldquo;บอกเลิกใช้บริการ (unsubscribe)&rdquo;
        ซึ่งแสดงอยู่ในไปรษณีย์อิเล็กทรอนิกส์ (email)
        หรือข้อความที่เกี่ยวข้องเพื่อเลิกการรับข้อความดังกล่าวในอนาคต
        โปรดทราบว่า หากท่านบอกเลิกใช้บริการแล้ว
        กลุ่มบริษัทแกร็บอาจยังส่งข้อความที่เกี่ยวเกี่ยวข้องกับการให้บริการให้แก่ท่าน
        เช่น ใบเสร็จการใช้บริการนั่งรถ
      </p>
      <p>
        หากท่านประสงค์ที่จะเพิกถอนความยินยอมที่กลุ่มบริษัทแกร็บได้รับจากท่านเพื่อวัตถุประสงค์ที่กำหนดภายใต้นโยบายนี้
        ให้ท่านแจ้งให้กลุ่มบริษัทแกร็บทราบตามรายละเอียดการติดต่อที่ระบุไว้ด้านล่างนี้
      </p>
      <p>
        <strong>การโอนข้อมูลส่วนบุคคล</strong>
      </p>
      <p>
        ข้อมูลส่วนบุคคลของท่านอาจถูกโอนให้ เก็บรักษา ใช้
        และประมวลผลในเขตอำนาจนอกประเทศที่ท่านอาศัยอยู่ หรือในประเทศ รัฐ
        และเมืองที่ท่านอยู่ขณะที่ใช้บริการของกลุ่มบริษัทแกร็บ
        (&ldquo;ประเทศอื่น&rdquo;)
        หรือให้แก่บริษัทภายใต้กลุ่มบริษัทแกร็บซึ่งตั้งอยู่นอกประเทศที่ท่านอาศัยอยู่หรือประเทศอื่น
        และ/หรือ สถานที่ตั้งของเซิร์ฟเวอร์ (server)
        และ/หรือสถานที่ตั้งของผู้ให้บริการ และคู่ค้า
        ซึ่งอยู่นอกประเทศที่ท่านอาศัยอยู่หรือประเทศอื่น
        ท่านเข้าใจและยินยอมให้มีการโอนข้อมูลส่วนบุคคลของท่านออกจากประเทศที่ท่านอาศัยอยู่หรือประเทศอื่นตามที่ระบุในประกาศนี้
      </p>
      <p>
        <strong>การเปิดเผยข้อมูลให้แก่บุคคลภายนอก</strong>
      </p>
      <p>
        ข้อมูลส่วนบุคคลของท่านอาจถูกโอน เข้าถึง
        หรือเปิดเผยต่อบุคคลภายนอกเพื่อวัตถุประสงค์ที่กำหนดหรือวัตถุประสงค์ที่ระบุไว้เพิ่มเติม
        นอกจากนี้ กลุ่มบริษัทแกร็บอาจจัดให้บริษัท ผู้ให้บริการ
        หรือบุคคลธรรมดาอื่นๆ มาปฏิบัติหน้าที่ในนามกลุ่มบริษัทแกร็บ
        และอาจให้บุคคลดังกล่าวเข้าถึงหรือเปิดเผยข้อมูลส่วนบุคคลของท่านแก่ผู้ให้บริการดังกล่าวหรือบุคคลภายนอก
        บุคคลภายนอกดังกล่าวรวมถึงโดยไม่จำกัดเฉพาะ
      </p>
      <ul>
        <li>
          คู่ค้าของกลุ่มบริษัทแกร็บ
          ซึ่งรวมถึงคู่สัญญาที่กลุ่มบริษัทแกร็บร่วมงานด้วยในการจัดงาน รายการ
          หรือกิจกรรม
        </li>
        <li>ผู้โฆษณา</li>
        <li>บริษัท ผู้จัดงานหรือผู้สนับสนุนการจัดงาน</li>
        <li>บริษัทวิจัยทางการตลาด</li>
        <li>
          ผู้ให้บริการ รวมถึง บริการเทคโนโลยีสารสนเทศเพื่อโครงสร้างพื้นฐาน
          ซอฟต์แวร์ และงานพัฒนาซอฟต์แวร์
        </li>
        <li>
          ที่ปรึกษามืออาชีพและผู้ตรวจสอบภายนอก รวมถึง ที่ปรึกษากฎหมาย
          ที่ปรึกษาและให้คำแนะนำทางการเงิน
        </li>
        <li>นิติบุคคลอื่นภายใต้กลุ่มบริษัทแกร็บ และ</li>
        <li>
          หน่วยงานราชการ เพื่อปฏิบัติตามกฎหมาย กฎระเบียบ และข้อกำหนดของทางราชการ
        </li>
      </ul>
      <p>
        ข้อมูลส่วนบุคคลของท่านยังอาจถูกเปิดเผยในการทำธุรกรรมเกี่ยวกับบริษัท เช่น
        การจัดตั้งบริษัทร่วมทุน การขายบริษัทลูกหรือแผนก การควบรวมกิจการ
        การควบเข้ากัน การขายทรัพย์สิน หรือการชำระบัญชี
      </p>
      <p>
        <strong>
          การขอเข้าถึงและคำร้องเพื่อแก้ไข และการสอบถาม
          การจำกัดการประมวลผลข้อมูลส่วนบุคคล
        </strong>
      </p>
      <p>
        ภายใต้บังคับของข้อยกเว้นตามกฎหมายที่ใช้บังคับในประเทศที่ท่านอาศัยอยู่หรือประเทศอื่น
        ท่านอาจขอเข้าถึงและ/หรือขอแก้ไขข้อมูลส่วนบุคคลของท่าน
        ขอจำกัดการประมวลผลข้อมูลส่วนบุคคลสำหรับวัตถุประสงค์เพิ่มเติมที่ระบุไว้
        และ/หรือสอบถามข้อมูลส่วนบุคคลของท่านได้โดยติดต่อไปยัง
      </p>
      <p>
        เจ้าหน้าที่ดูแลข้อมูลของแกร็บ (Grab Data Protection Officer)
        <br />
        บริษัท แกร็บ โฮลดิ้ง อิงค์ (Grab Holdings Inc.)
        <br />6 เชนตัน เวย์ (6 Shenton Way)
        <br />
        เลขที่ 38-01 โอยูอี ดาวน์ทาวน์ (#38-01 OUE Downtown)
        <br />
        สิงคโปร์ (Singapore) 068809
      </p>
      <p>
        ไปรษณีย์อิเล็กทรอนิกส์ (email):&nbsp;
        <u>
          <a href="mailto:dataprotection@grab.com">dataprotection@grab.com</a>
        </u>
        <br />
        ภายใต้บังคับแห่งกฎหมายของประเทศที่ท่านอาศัยอยู่หรือประเทศอื่น
        กลุ่มบริษัทแกร็บสงวนสิทธิ์ในการเรียกเก็บค่าธรรมเนียมในการเข้าถึงข้อมูลส่วนบุคคลของท่านในจำนวนที่ได้รับอนุญาตภายใต้นโยบายนี้
      </p>
      <p>
        สำหรับสิทธิของท่านในการเข้าถึงและ/หรือแก้ไขข้อมูลส่วนบุคคลของท่าน
        กลุ่มบริษัทแกร็บมีสิทธิที่จะปฏิเสธคำขอเพื่อเข้าถึงและ/หรือแก้ไขข้อมูลส่วนบุคคลของท่านเป็นไปตามเหตุที่กฎหมายอนุญาต
        การให้ท่านเข้าถึงข้อมูลดังกล่าวอาจส่งผลกระทบต่อสิทธิในความเป็นส่วนตัวของท่านหรือบุคคลอื่น
      </p>
      <p>
        <strong>คุ้กกี้</strong>
        <strong>&nbsp;(Cookies)</strong>
      </p>
      <p>
        กลุ่มบริษัทแกร็บ และบุคคลภายนอกซึ่งเป็นคู่ค้าของแกร็บอาจใช้คุ้กกี้
        (cookies) เว็บบีคอน (web beacon) ป้ายระบุ (tag) คำสั่ง (script)&nbsp;
        วัตถุใช้ร่วมกันเฉพาะที่ (local shared objects) เช่น เอชทีเอ็มเอล 5
        (HTML5) และ แฟลช (Flash)&nbsp; (ซึ่งบางครั้งเรียกว่า &ldquo;แฟลชคุ้กกี้
        (flash cookies)&rdquo;) เครื่องมือระบุโฆษณาที่เกี่ยวข้อง (advertising
        identifiers) (รวมถึงเครื่องมือระบุโฆษณาในโทรศัพท์มือถือ เช่น
        ไอดีเอฟเอของบริษัทแอปเปิ้ล (Apple&rsquo;s IDFA)
        หรือแอดเวอร์ไทซิ่งไอดีของกูเกิ้ล (Google&rsquo;s Advertising ID)
        และเทคโนโลยีที่คล้ายคลึงกัน (ต่อไปนี้จะเรียกว่า &ldquo;คุ้กกี้&rdquo;)
        ในการใช้เว็บไซต์หรือแอปพลิเคชันต่าง ๆ โดยคุ้กกี้อาจมีตัวระบุพิเศษ
        และอาศัยอยู่ในคอมพิวเตอร์ โทรศัพท์มือถือของท่าน ไปรษณีย์อิเล็กทรอนิกส์
        (email) ที่กลุ่มบริษัทแกร็บส่งให้แก่ท่าน
        และบนหน้าเว็บของกลุ่มบริษัทแกร็บ ฯลฯ
        และคุ้กกี้อาจถ่ายทอดข้อมูลเกี่ยวกับท่านและการใช้บริการของท่าน เช่น
        ประเภทของเบราว์เซอร์ (browser) ที่ท่านใช้ การเลือกคำค้นหา ไอพีแอดเดรส
        (IP address) ข้อมูลที่เกี่ยวกับโฆษณาซึ่งได้แสดงให้ท่านเห็นหรือ
        <br />
        ที่ท่านได้คลิกเลือก และวันที่และเวลาของการใช้งาน ทั้งนี้
        คุ้กกี้อาจยังคงอยู่และถูกจัดเก็บเฉพาะระหว่างช่วงเวลาใดช่วงเวลาหนึ่งเท่านั้น
      </p>
      <p>
        กลุ่มบริษัทแกร็บอาจอนุญาตให้บุคคลภายนอกใช้คุ้กกี้บนเว็บไซต์และแอปพลิเคชันเพื่อจัดเก็บข้อมูลในลักษณะเดียวกันกับที่กลุ่มบริษัทแกร็บจัดเก็บเพื่อประโยชน์สำหรับกลุ่มบริษัทแกร็บเอง
        บุคคลภายนอกอาจสามารถเชื่อมโยงข้อมูลที่จัดเก็บโดยบุคคลภายนอกเองกับข้อมูลอื่น
        ๆ
        ที่มีเกี่ยวกับท่านซึ่งได้มาจากแหล่งข้อมูลอื่นโดยบริษัทอาจไม่จำเป็นต้องเข้าถึงหรือควบคุมคุ้กกี้ที่ใช้โดยบุคคลภายนอก
      </p>
      <p>
        นอกจากนี้
        บริษัทอาจเปิดเผยข้อมูลที่ไม่ใช่ข้อมูลที่สามารถระบุตัวบุคคลได้ซึ่งได้มาจากหรือเกี่ยวกับท่านให้แก่บุคคลภายนอก
        เช่น ข้อมูลของสถานที่ตั้ง เครื่องมือระบุโฆษณาที่เกี่ยวข้อง (advertising
        identifiers) หรือการเข้ารหัสแบบทางเดียว (cryptographic hash)
        ของเครื่องมือระบุบัญชีร่วม (เช่น ที่อยู่ไปรษณีย์อิเล็กทรอนิกส์ (email
        address)) เพื่ออำนวยความสะดวกในการแสดงโฆษณาเป้าหมาย
      </p>
      <p>
        หากท่านไม่ประสงค์ให้มีการจัดเก็บข้อมูลส่วนบุคคลผ่านคุ้กกี้บนเว็บไซต์
        ท่านอาจปิดการใช้งานคุ้กกี้ได้โดยปรับการตั้งค่าอินเทอร์เน็ตเบราว์เซอร์
        (internet browser) เพื่อปิด บล๊อค
        หรือระงับการใช้งานคุ้กกี้โดยลบประวัติการเยี่ยมชมและลบแคช (cache)
        จากอินเทอร์เน็ตเบราว์เซอร์ (internet browser) ของท่าน
        ท่านอาจจำกัดการเปิดเผยข้อมูลบางส่วนผ่านการตั้งค่าของโทรศัพท์มือถือของท่านได้
        หรือโดยการส่งรายละเอียดของท่านผ่านช่องทางนี้&nbsp;
        <a
          href="https://docs.google.com/forms/d/e/1FAIpQLSdrxEfVaMXC9CNc3_J3p-1m1Ndvvbg2mwYuVLh6JLHKWSN6RQ/viewform"
          target="_blank"
          rel="noopener"
        >
          ที่นี่
        </a>
      </p>
      <p>
        <strong>ลิงค์สำหรับเชื่อมต่อไปยังเว็บไซต์ของบุคคลภายนอก</strong>
      </p>
      <p>
        เว็บไซต์ของกลุ่มบริษัทแกร็บอาจมีลิงค์สำหรับเชื่อมต่อไปยังเว็บไซต์ของบุคคลภายนอก
        โปรดทราบว่ากลุ่มบริษัทแกร็บไม่รับผิดชอบใด ๆ ต่อการจัดเก็บ การใช้
        การเก็บรักษา หรือการเปิดเผยข้อมูลโดยบุคคลภายนอกนั้น
        หากท่านให้ข้อมูลโดยตรงแก่เว็บไซต์ดังกล่าว
        นโยบายด้านความเป็นส่วนตัวและข้อกำหนดของการให้บริการสำหรับเว็บไซต์นั้นๆ
        ย่อมมีผลใช้บังคับ
        และกลุ่มบริษัทแกร็บไม่มีหน้าที่ต้องรับผิดชอบต่อการดำเนินการประมวลผลข้อมูลหรือนโยบายด้านความเป็นส่วนตัวของเว็บไซต์นั้น
      </p>
      <p>
        <strong>ข้อมูลส่วนบุคคลของผู้เยาว์และบุคคลธรรมดาอื่น</strong>ๆ
      </p>
      <p>
        ในฐานะบิดามารดาหรือผู้ปกครองตามกฎหมาย กรุณาอย่าอนุญาตให้ผู้เยาว์
        (บุคคลธรรมดาที่มีอายุต่ำกว่า 18 (สิบแปด) ปี) ภายใต้การดูแล
        <br />
        ของท่านให้ข้อมูลส่วนบุคคลแก่กลุ่มบริษัทแกร็บ
        ในกรณีที่ได้ให้ข้อมูลส่วนบุคคลดังกล่าวแก่กลุ่มบริษัทแกร็บ ให้ถือว่า
        ท่านยินยอมให้มีการประมวลผลข้อมูลส่วนบุคคลของผู้เยาว์นั้น
        และยินยอมและตกลงที่จะผูกพันต่อประกาศนี้เป็นการส่วนตัวและรับผิดชอบต่อการกระทำของผู้เยาว์
      </p>
      <p>
        ในบางกรณี ท่านอาจให้ข้อมูลส่วนบุคคลที่เกี่ยวข้องกับบุคคลอื่น (เช่น
        คู่สมรส สมาชิกในครอบครัว หรือเพื่อน)
        และในกรณีดังกล่าวท่านรับรองและรับประกันว่าท่านได้รับอนุญาตให้เปิดเผยข้อมูลส่วนบุคคลของบุคคลดังกล่าวต่อกลุ่มบริษัทแกร็บแล้ว
        และท่านได้รับความยินยอมให้มีการประมวลผลและใช้ข้อมูลส่วนบุคคลดังกล่าวในลักษณะตามที่ระบุไว้ในนโยบายนี้
      </p>
      <p>
        <strong>การยอมรับ การให้ความยินยอม และการเก็บรักษาข้อมูล</strong>
      </p>
      <p>
        เมื่อมีการติดต่อกับกลุ่มบริษัทแกร็บ ใช้บริการของกลุ่มบริษัทแกร็บ
        ซื้อผลิตภัณฑ์จากกลุ่มบริษัทแกร็บ หรือมีส่วนร่วมใด ๆ กับกลุ่มบริษัทแกร็บ
        ท่านยอมรับว่า ท่านได้อ่านและเข้าใจนโยบายนี้
        และตกลงให้ความยินยอมแก่กลุ่มบริษัทแกร็บในการใช้ ประมวลผล
        และโอนข้อมูลส่วนบุคคลของท่านตามที่ระบุไว้ในนโยบายนี้
      </p>
      <p>
        กลุ่มบริษัทแกร็บมีสิทธิที่จะเปลี่ยนแปลง ปรับปรุงให้เป็นปัจจุบัน
        หรือแก้ไขข้อกำหนดของนโยบายนี้ในเวลาใด ๆ
        โดยลงประกาศที่ได้รับการปรับปรุงให้เป็นปัจจุบันแล้วลงบนเว็บไซต์
        เมื่อท่านตกลงที่จะติดต่อ ใช้บริการ ซื้อผลิตภัณฑ์
        หรือมีส่วนร่วมกับกลุ่มบริษัทแกร็บต่อไปภายหลังจากการเปลี่ยนแปลง
        ปรับปรุงข้อมูลให้เป็นปัจจุบัน หรือแก้ไขนโยบายนี้
        ให้ถือว่าท่านได้ตกลงให้มีการเปลี่ยนแปลง ปรับปรุงให้เป็นปัจจุบัน
        หรือแก้ไขดังกล่าวแล้ว
      </p>
      <p>
        ในกรณีที่มีความขัดแย้งระหว่างนโยบายฉบับภาษาอังกฤษและภาษาอื่นๆ
        ให้ถือเอานโยบายฉบับภาษาอังกฤษเป็นสำคัญ
      </p>
    </div>
  );
};
